[
      [
            "Good morning. Just on the regional space, Scott, it sounds like you're putting these aircraft in kind of mission-appropriate markets. And now that you've had a chance to review the network and maybe adoption rates to increase connectivity, are you still thinking that the regional fleet will be flattish after the year-end 2017 levels? And on that -- the Air Wisconsin deal, I was wondering how big that deal is and if that puts cost pressure or if it's cost neutral.",
            [
                  "And we're putting smaller planes in markets that will drive better connectivity to our hubs, places like Champaign, Illinois and Rochester, Minnesota. These [indiscernible] markets have better pricing structure than large markets and help to improve connectivity in our hubs. We'll continue to improve connectivity, and we will start re-banking later this fall, which will be the next step in our network optimization."
            ]
      ],
      [],
      [
            "Hey Greg. As you're thinking about this plan to grow domestic capacity, nearly 6% in the June quarter, it would be great to hear from you, your level of involvement in that aggressive plans, what preparations you've made, what lead times look like for staffing and training. And then what gives you confidence that United historically more careful approach to utilization flying is now able to change?",
            [
                  "Our full year outlook for system capacity growth remains up 2.5% to 3.5% and is consistent with our updated guidance from March 15. Our capacity growth is comprised of nearly a 5% increase in gauge, partially offset by fewer departures. We're delivering on our promises from Investor Day, which included restoring the domestic network to its natural share in our hubs."
            ]
      ],
      [],
      [],
      [],
      [],
      [
            "Thanks. Just want to go back to Medicaid for a minute. Can you talk a little bit about, I think you mentioned that in Q4, maybe you saw some improvement on Medicaid, but can you talk about the expectation for the year, I guess in particular, I guess two things, one is the implication of redeterminations and the rate updates will get relative to that, how are the rate updates going and do you – are you modeling additional rate determinations as the year goes on? And then second just quickly going back to the North Carolina, if North Carolina got delayed into 2021, would that impact your EPS guidance or is it more towards the revenue number at this point?",
            [
                  "We enter 2020 with diversified growth momentum, balance sheet strength and financial flexibility. On earnings progression, we continue to expect 47% to 48% of full year earnings per share to be realized in the first half of the year, a point to keep in mind on that quarterly progression. 2019’s first quarter has one fewer work day than 2018’s resulting in a higher earnings level. This year, the first quarter had a more normal mix, but then adds an extra day due to leap year. Taken together, the day count shifting has a year-over-year impact on the medical care ratio of about 80 basis points. This will result in the first quarter 2020 MCR running higher than the second quarter and earnings per share progressing accordingly, with just under 55% of the first half earnings expected to be realized in the second quarter. These impacts of course were fully contemplated in that 2020 outlook we have provided at the beginning of December. For full year 2020, we continue to expect revenues to approach $262 billion and adjusted net earnings per share in a range of $16.25 to $16.55. Consistent with our prior practices, we will more formally address these and other expectations after the first quarter."
            ]
      ],
      [
            "Yes, hi, good morning. So, you reiterated guidance this morning for 2020, just want to clarify if the guidance already includes any impact from HIT repeal on midyear renewals and also the benefit from the Diplomat acquisition? And then another follow-up on the dual growth, I mean, obviously 15% to 20% is what is the implied growth which is strong and above market, but when we think about that, can you just kind of like help us think through the Part D dynamics and how that would slow through the P&L if it’s going to to have any impact on OptumRx throughout the year?",
            [
                  "We enter 2020 with diversified growth momentum, balance sheet strength and financial flexibility. On earnings progression, we continue to expect 47% to 48% of full year earnings per share to be realized in the first half of the year, a point to keep in mind on that quarterly progression. 2019’s first quarter has one fewer work day than 2018’s resulting in a higher earnings level. This year, the first quarter had a more normal mix, but then adds an extra day due to leap year. Taken together, the day count shifting has a year-over-year impact on the medical care ratio of about 80 basis points. This will result in the first quarter 2020 MCR running higher than the second quarter and earnings per share progressing accordingly, with just under 55% of the first half earnings expected to be realized in the second quarter. These impacts of course were fully contemplated in that 2020 outlook we have provided at the beginning of December. For full year 2020, we continue to expect revenues to approach $262 billion and adjusted net earnings per share in a range of $16.25 to $16.55. Consistent with our prior practices, we will more formally address these and other expectations after the first quarter."
            ]
      ],
      [
            "Good morning guys. Thanks for the question. I guess at this stage I was just wondering if you could give us a sense of the HIT repeal how we should be starting to thinking about modeling that in whether you commit to sort of at least the non-tax deductibility of it going away kind of falling to the bottom line or is it still too early? And then maybe just to your comment on OptumHealth just given the risk-taking nature of what you guys are doing, I thought it would be interesting to hear from you all how the flu impacted the economics of that business in Q4 thinking sort of revenue earnings margin? Thanks.",
            [
                  "The health system we are helping to build will better meet the personalized needs of people. It leverages the next generation data analytics such as the individual health record to empower patients and their doctors with actionable intelligence that drives next best actions to improve decision-making in real time. We are committed to a future where every person has access to high-quality affordable healthcare that meets their unique healthcare needs and financial means. We are employing specific actions to help achieve this driving better health outcomes and aiming ultimately to reduce the healthcare cost trends to general inflation levels even with an aging, more chronically ill population. Notably, the bipartisan repeal of the ACA taxes in December was the strongest step towards improving affordability for Americans. It will greatly assist those who have been most affected by the cost of those taxes, especially seniors, small employers and those who are individually insured. As we continue to do better for those we serve, we will grow helping improve the health system, one person at a time intensely focused on driving improved consumer and physician experiences. Looking to the years ahead, our strengthening capabilities and diversified complementary businesses operating in the large growing healthcare market positioned us well to achieve our long-term adjusted earnings per share growth rate objective of 13% to 16%, while we continue as always to invest in the future for sustainable, market-leading performance and advancing shareholder returns."
            ]
      ],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [
            "Yes. Hey. Thanks for taking the question. Dave, I think at the beginning, you talked about your digital platform here. And I think you mentioned something like you think you can deliver double-digit cost reductions, and later you guys mentioned seeing a $1 billion in productivity savings from digital efforts. Is that something that you've been able to market to potential clients for 2020 or is that something you're talking about that's going to be rolling on and how much of that would you expect to deliver declines versus we could expect to fall to the bottom line? Thanks.",
            [
                  "And as always, we are focused on reducing the cost of administering health care and ensuring system integrity. Technology is enabling these efforts. We’re investing in digital tools to support doctors, reducing their administrative burden while improving efficiency and affordability across the system. For example, care provider phone calls to us have decreased nearly 10% this year, thanks to these digital investments. Our productivity and automation efforts this year and next should save us over $1 billion. And our fraud, waste and abuse program should save customers more than $1 billion next year as well."
            ]
      ],
      [
            "Thank you. We've been running the math on the Medicaid enrollment, and if we take out the contract updates, it looks like the impact of the industry-wide trend of shrinkage of state eligible roles had a very minimal impact sequentially. So, I'm wondering if you think that that swooning process is over. And can you update us on the discussions with states to adjust rates for the impact on acuity mix from that roles coming, any progress there, either retroactive or forward given more close to the rate setting season for a handful of states?",
            [
                  "Our relentless focus on quality, experiences and costs is increasingly apparent. Our NPS levels have never been higher; we just completed our regular three-year Medicare audit with exceptional results; expected members in 4 Stars or greater plans for 2021 payment year are at an all-time high of 84% at UHC and a consistently strong 92% at Optum. Every one of our Medicaid states are referenceable. Our overall per capita health care cost trends have averaged well below 4% for the past half decade, even as we’ve expanded MA benefits, and our operating costs continue to come in line, preserving consumer premiums for medical care. I could go on. You should get a sense today that our business is progressing across multiple dimensions with many of our growth and performance efforts beginning to fall in place."
            ]
      ],
      [
            "Great. Thanks. Good morning, everybody. Thanks for taking the question. So, just drilling in a little bit deeper on Medicare Advantage. This question always seems to come up around this time of year. But with the CMS projecting 10% membership growth in 2020, just curious if your view is consistent with that of CMS for next year or are you still viewing the MA market growth slightly more conservatively in the 7% to 8% range, based on some of your historical comments?",
            [
                  "Our relentless focus on quality, experiences and costs is increasingly apparent. Our NPS levels have never been higher; we just completed our regular three-year Medicare audit with exceptional results; expected members in 4 Stars or greater plans for 2021 payment year are at an all-time high of 84% at UHC and a consistently strong 92% at Optum. Every one of our Medicaid states are referenceable. Our overall per capita health care cost trends have averaged well below 4% for the past half decade, even as we’ve expanded MA benefits, and our operating costs continue to come in line, preserving consumer premiums for medical care. I could go on. You should get a sense today that our business is progressing across multiple dimensions with many of our growth and performance efforts beginning to fall in place."
            ]
      ],
      [],
      [
            "Hi. Good morning. I had a question about a couple of public policy changes and just your thoughts on those. The first would just be the health reimbursement accounting rules for 2020. Do you anticipate shift from small group to individual either near-term or long-term and how are you positioned for that given your footprint pullback in the individual market? And the second would just be public charge rule. I know we had an injunction issued last week, but absent that, there is estimates of 200,000 to 4 million people potentially coming off Medicaid, and if you'd want to venture a thought on what that impact might be? Thanks.",
            [
                  "Our growth agenda is purpose built to align with the changes necessary to develop the next generation, more modern and effective health system. We are reinventing health care delivery, now directly serving 25 million patients in 35 local U.S. markets and in South America; transforming pharmacy care services, driving transparent, digitally enabled, high-quality plan designs at lower costs with more consumer responsive point-of-sale discounts, saving nearly $2,000 per person per year on average. Accelerating digital, our consumer digital platform, serving nearly 20% of the U.S. population by January 2020, is being extended to include proprietary, deeply personalized next best action recommendations within portable medical records maintained real-time for nearly 50 million Americans and their doctors. Engagement strategies and incentives around this data hold the potential to achieve double-digit cost of care reductions. And advancing consumer-centric benefits. Our Bind, NexusACO, Allsavers and Harmony products are beginning to gain considerable traction in the commercial markets this fall. And our Medicare Advantage and Dual offerings are well-positioned to again drive distinctive growth from the differentiated value we deliver to people."
            ]
      ],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [
            "Hi, thanks. Just as you said as the market continues to debate the overall trajectory of the economy exiting 2018 and its 2019. Do you have got a lot of sort of – few points on that in terms of how the overall economy is progressing in both the UnitedHealthcare and in the Optum businesses. So just interested maybe in some of the more economically sensitive areas what you are seeing in terms of trends in the fourth quarter, particularly related in the fourth quarter relative to the third quarter?",
            [
                  "To summarize, our expectations for UnitedHealthcare’s performance in 2019 are unchanged with what we outlined for you at the end of November. As we look at 2019, 2020 and beyond, we are strengthening our capabilities for customers across UnitedHealthcare and UnitedHealth Group. We have a multi-billion dollar, multi-year effort, well underway to address medical and operating cost on a structural basis and improved value for customers."
            ]
      ],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [
            "The earnings beat was a little bit more than double the guidance raise, so can you walk us through bits and points of conservatism or maybe some offsets and headwinds that would bridge us to the beat versus the guidance raise? And then you're estimating that tax coming below guidance is about $0.10 of a beat, so is the 24% guidance on tax rate still the right number for the year?",
            [
                  "Looking ahead, our earnings outlook balances the fundamental performance strengths seen across the company in the first quarter, our usual prudent respect for medical costs inclusive of the impact of flu in the first quarter; increased investment spending in the second half as planned; and a modest in-year headwind from the health insurance tax deferral, which has increasing impact through the course of the year. Taken together, we've raised our expectations for 2018 adjusted earnings to a range of $12.40 to $12.65 per share or growth of more than 24% over 2017 at the midpoint. Dave?"
            ]
      ],
      [
            "Alright, that’s helpful. Thank you. And Gary, maybe one follow-up just on guidance, it looks like your revenue guidance update implies 1% to 5% reported growth over the balance of fiscal ‘18 over the next three quarters, I have got currency in my model adding probably 250 basis points over the next three quarters, so just trying to figure a kind of flattish organic revenue over each of the next three quarters is kind of – is that you guys being just over conservative at this point, is there something where first quarter took some out of the next few quarters, just how should we think about kind of your constant currency or your organic revenue expectations for the next few quarters?",
            [
                  "Thanks, Mike and good afternoon everyone. Today, I will share the key milestones we achieved this past quarter and how they contributed to our long-term strategy. First, let me touch on our first quarter results. Total company revenues of $679 million increased 13%. Oncology revenues grew 14% and the particle therapy business declined 4% in the quarter. Operating earnings of $126 million or 18.6% of revenue grew 84% in part due to the non-recurrence of an accounts receivable reserve taken in the prior year."
            ]
      ],
      [
            "Alright, that’s helpful. Thank you. And Gary, maybe one follow-up just on guidance, it looks like your revenue guidance update implies 1% to 5% reported growth over the balance of fiscal ‘18 over the next three quarters, I have got currency in my model adding probably 250 basis points over the next three quarters, so just trying to figure a kind of flattish organic revenue over each of the next three quarters is kind of – is that you guys being just over conservative at this point, is there something where first quarter took some out of the next few quarters, just how should we think about kind of your constant currency or your organic revenue expectations for the next few quarters?",
            [
                  "Thanks, Mike and good afternoon everyone. Today, I will share the key milestones we achieved this past quarter and how they contributed to our long-term strategy. First, let me touch on our first quarter results. Total company revenues of $679 million increased 13%. Oncology revenues grew 14% and the particle therapy business declined 4% in the quarter. Operating earnings of $126 million or 18.6% of revenue grew 84% in part due to the non-recurrence of an accounts receivable reserve taken in the prior year."
            ]
      ],
      [],
      [
            "Great. So Gary or Dow, I guess for you, just looking at the revenue guidance, again with the 2% to 4%, you did have 7% oncology order growth this past year, 11% I think companywide with a strong year in proton. I typically think of service and software contributing a couple points to fiscal 2018 revenue growth. So why are hardware revenue, I guess, essentially being guided flat to maybe up only slightly this coming year, given how strong the order growth was in the past year?",
            [
                  "First let me touch on our fourth quarter results, which concludes a transformative year. Total company revenues declined 1%. Oncology revenue grew 1%, while the proton business declined 23% in the quarter. GAAP earnings per share was $0.89, down 10%. Non-GAAP earnings per share grew 5% to $1.09. Gary will provide more details on the drivers of these results during his discussion."
            ]
      ],
      [
            "Alright that's fine. X all that noise and we could use your $1.09 number for the quarter that equates to a little over $100 million in net earnings X that. So if we start there is a base I don't want to dominate the time here but if we start there is a base. You're guiding over the next three quarters. I think between the two businesses, the net earnings and if we take the EPS out of it just because again the share count changes with Varex and that you're guiding to about 330 million in net earnings between the two companies, if I add that to the 105 million or so you're essentially guiding combined companies all noise out of it at somewhere around 435 million I think. Is that about reasonable because the street was at 442, I think you guys are guiding somewhere around 435 and there are some big numbers floating around here in emails and all that that you guys are cutting $0.20, $0.30, $0.40 out of what where Street has been thinking and I'm just not getting it that big?",
            [
                  "To summarize, our first quarter results we are reporting, strong oncology global order growth of 10% together with a four point improvement in its gross margin rate. Imaging Components gains in both orders and revenues, company-wide revenues of $763 million up 1% in both dollars and constant currency. GAAP net earnings of $0.22 per diluted share, after reporting $0.64 per diluted share in charges related almost exclusively to CPTC. Non-GAAP net earnings of $0.75 per diluted share, after recording $0.34 per diluted share in charges related almost exclusively to an accounts receivable reserve for CPTC and Board approval of the spinoff of Imaging Components into a new public company Varex Imaging in the next few days."
            ]
      ],
      [],
      [
            "So, if I could just kind of get a little bit into the Brookdale rent issue. So, I think if I’m reading this right, you start off with at $8 million of rent concession this year and it trickles down into $5 million in 2025, and there is a profits that’s get you there. So, from adding it up right its $48 million of rent cuts collectively over eight years. So, if the question -- is it appropriate to say that well you maybe aren’t resolving the coverage issue all it once, but you’re doing a gradually overtime and then once the as you call the silver wave hits in 2025, hopefully, you have achieved the goal of appropriate coverage or even better coverage by that time. Is that a good way to think about it?",
            [
                  "To give Brookdale support and stability while it executes its operational turnaround under its new team, we've provided an average of $6 million and annual rent credit to Brookdale in each of the remaining years of the lease, which provides even greater reliability for our future cash flow. We’ve also agreed on the straightforward objective change of control standard for Brookdale, balance with significant credit and other enhancements for us is a change of the control does occur."
            ]
      ],
      [
            "Hi, thanks. Good morning. Your pace of M&A activity has picked up in recent quarters, particularly with the acquisition of Genscape. When you had a similar level of M&A activity in 2018, EBITDA margins did contract by about 100 bps. So diving deeper into margins in the year ahead, can you discuss how the margin profile Genscape compares to your earlier acquisitions particularly ones being integrated in 2018. And if you intend to change your pace of investment activity in the breakout opportunities this year ahead versus earlier years? Thank you.",
            [
                  "Thanks, Stacey. Good morning, everyone. I'm pleased to share that 2019 was another strong year for Verisk marked by solid financial results, while we continue to invest for future growth. Normalizing for the revenue impact of the injunction related to our roof measurement solutions, we delivered organic constant currency revenue growth of 6.9%, and organic constant currency adjusted EBITDA growth of 7.7%, demonstrating organic margin improvement in 2019. Moreover, our growth was driven by broad-based strength across our Insurance vertical and marked improvement in energy and specialized markets."
            ]
      ],
      [
            "Thanks, good morning. I appreciate some of the detail on tax reform. Just wanted to drill down here a little bit more. First, you talked about the 400 to 500 million and most of that or more than half of that being from the health insurer fee impact. I think it's pretty clear that you know the grossed up of the Medicaid - Medicaid states would require to give you back, needs to be smaller because the taxes go down, but beyond that can you help us understand how much that is of the half or more that’s 400 to 500, how much is commercial and how much is Medicare that you might have passed through which I assume is zero on Medicare. And then more importantly for 2019, would love to hear your thoughts on the sustainability of the tax reform benefit that you’re seeing here in 2018 including any differentiation on that sustainability by business would be really helpful. Thanks.",
            [
                  "Thank you, Steve. We delivered strong well-balanced performance again in 2017. Consolidated revenues exceeded $201 billion, cash flow from operations were $13.6 billion and adjusted earnings per share of $10.07 increased 25% on top of 25% earnings growth in 2016. We re-valued our US deferred tax liabilities to reflect the newly enacted federal statutory rate of 21% which added $1.2 billion in non-cash earnings in 2017. We have excluded this from adjusted earnings per share. Our expectations for 2018 have been revised solely to reflect the lower expected tax rate now approximately 24%. The incremental investments Dave referred too and items such as rebate obligations related to loss ratio requirements, triggered by the lower tax rate."
            ]
      ],
      [
            "Energy and specialized saw the highest organic growth rate in 3 years and Neal, you talked about how you see stronger growth in the coming 5 years. The data source that I use for industry CapEx trends has been revising down sort of growth rates in the next couple of years. So I wanted to sort of get a sense of, if you have any color on how you're thinking about -- are you outperforming the market because of the products that you're providing? Is your pipeline strong because of your sales process or products? I guess just what's the disparity between maybe some of the data sources and what you're seeing.",
            [
                  "Thank you, Scott. It's a pleasure to be here this morning to talk to you about our Energy and Specialized Markets business. I will discuss the macro environment in which the energy and specialized vertical operates where the focus on higher businesses are performing. I will also highlight our recent success leveraging the expertise of our PowerAdvocate business and to the extent of Wood Mackenzie energy and mining customer base. And lastly, we'll give you an update on the customer response to Lens, Wood Mackenzie's new data analytic platform. Regarding the macro environment. As you are aware, the oil and gas industry has been through a very challenging time over the last few years due to the falling oil prices. However, the industry in 2019 is in a much better shape than it was prior to the oil price crash in 2015. The oil and gas industry responded with amazing speed and focus to the drop in oil prices, aggressively cutting costs and rebuilding balance sheets, divesting noncore assets, which allowed them to concentrate upon low-cost, long life things. In turn, free cash flow has become the key financial metric. Indeed, in 2018, free cash flow surpassed the previous peak seen in 2012 when oil prices were above $100 a barrel. In summary, our oil and gas customers are in robust health with their focus now returning to new investments. We estimate future capital investment will exceed $200 billion in the next few years. As a result, we believe the majors will deliver stronger production growth in the coming 5 years, are poised to recover stronger growth for 5 years down the pre-oil price crash. Simultaneously, our downstream and finance platforms team continued strong demand, particularly in emerging markets leading to new investment in the Middle East, Africa and Asia. Our core energy customers are also grappling with opportunities and challenges presented by climate change and the need for an energy transition to lower carbon energy sources. As you are aware, we have established 2 breakout businesses to specially support and advise our customers in these areas, namely chemicals and power and renewables. The chemicals business continues to deliver strong double-digit growth as customers recognize that the primary driver of oil demand is likely to become chemical demand over the medium and long term. This is a far"
            ]
      ],
      [
            "Hi, thanks, good morning. I'd like to drill deeper into the Financial Services business; you touched on plans to reduce the variability of revenues through the restructuring of contracts. Can you elaborate on the initiatives you have to improve the overall growth of the segment? Because in the quarter, even after normalizing for the year-ago implementation revenues associated with TSYS, organic growth would have been pretty muted, any color there would be helpful?",
            [
                  "Thank you, Stacey and good morning everyone. Apologies for my voice today. As we turn the page on 2018, I want to give you my bottom line view of the year just passed. We did well and see opportunity to improve. The single most important reflection of our vitality is our rate of organic revenue growth and normalizing for the effects of exceptional storm-related revenues and a significant contract signing in Financial Services in 2017. Our organic constant currency revenue growth was 7.2%, ahead of our long-term financial target of 7%. Moreover, our growth was broadly based across our Insurance vertical, along with Wood Mackenzie in the Energy space and our core consortium, data analytics in the Financial Services vertical. The heart of our position in the three verticals is sound and forms the basis for cross-selling new solutions in the future."
            ]
      ],
      [
            "Thanks a lot for the questions, guys. Wanted to just touch on the $400 million to $500 of minimum MLR rebates. I’m sort of curious to understand whether that had anything to do with sort of pricing plans for the all tax regime and what that could mean for 2019. And relatedly on the incremental investments side of things these were described as accelerated programs in the release. And I’m wondering if you can sort of give us a flavor for how much flexibility that might enable for 2018 and then looking into 2019 as well?",
            [
                  "Finally, we continue to innovate to better serve market needs. We doubled the number of people with Rally IDs in 2017, now more than 15 million, while administrating more than $400 million in consumer incentives. Market interest for this type of scale tested solution is growing. A large local health plan selected Rally as its consumer technology platform and several renowned hospitals are now using Rally for everything from searching for a physician to pricing the appointment and appointment schedule."
            ]
      ],
      [
            "That's helpful. And then on the Argus -- or financial services organic outlook, I think there was a moment at the Investor Day where there's a question about should 2018 be an outsized growth year. And I think, Scott, you said it was your expectation, that Nana was nodding his head yes. And then there was a comment today about, I think, a grow-over effect from the onetime revenue in '17 as in -- a large new client comes online. So is the expectation, even including that 2018 Argus, has an outsized organic growth year?",
            [
                  "At our recent Investor Day, I described the 5 qualities that make our company a moated business, which can produce strong organic revenue growth on a sustained basis, those being, one, vertical market expertise; two, unique datasets, ideally contributed by our customers; three, deep integration with customer workflows; four, global reach leading to an expanding customer account; and five, synergies arising from the sharing of methods and capabilities across our enterprise. I see progress on all fronts. And over the last 90 days, I'm particularly struck by our growing effectiveness in overseas markets, particularly the U.K. As a result, our organic revenue growth in the quarter was 7.6%, consistent with our longer-term goals. Our rate of organic EBITDA growth in the quarter was about 5%, lower than revenue growth and a function, particularly, of the significant investment we made in Geomni as we continue to ramp up that operation. In 2018, I expect that relationship to be reversed, meaning enterprise organic EBITDA growth greater than organic revenue growth."
            ]
      ],
      [
            "I wanted to go back to tax reform and the long-term sustainability of the benefit. I appreciate that facing change over the next year, so you have to watch and wait. I guess I start with United actually and actually almost literally wrote the book on pricing per membership. And although I guess competitors might decide to put that back in the benefits, you obviously don't have to follow a suite. And so I would think that would be largely -- how much of benefits you decided to keep versus not keep, so maybe you could give some perspective on that. And then is there any thoughts initially about where you think competition wise there might be more pressure within the business? I would think that most of the Optum businesses actually will probably have less pressure than the health plan businesses. But want to get your perspective on that?",
            [
                  "We know the effects of tax changes for 2018 are top of mind for many. So we will begin there today with corporate tax reform. Our starting point for determining our approach was with our mission helping people live healthier lives and helping make the health system work better for everyone and our recognition of the enormous gap between where healthcare is today and where it could and should be. We concluded that our ambitions for a better health and for a better health system are best achieved through investment in ways that will make healthcare far more affordable and of far higher quality."
            ]
      ],
      [],
      [
            "Okay. And then a clarification on the 7% to 8% constant currency organic target for the total insurance including and plus financial services. When we talked about this in early May, at that point it looked like about two-thirds of that target was under contract and about one-third was coming from new sales; and I just wanted to check whether we were still on-track for that for the year and I wanted to also -- I mean, back at the envelope it looked like that combined organic constant currency was somewhere in the 4% to 5% range for the second quarter, that's my math and I know your math is better than mine; so I just wanted to check that.",
            [
                  "Thank you, David. Good morning, everybody. Reported revenue grew 5% for the quarter. Organic constant currency growth was 4.1%. As expected we are seeing the performance progression we discussed on our first quarter earnings call. Profitability remained strong with total EBITDA margins of around 49% and diluted adjusted EPS increased about 12%. When I look at the organic initiatives and recent acquisitions, I'm very encouraged by our people, our assets and the outlook. Our teams are working hard on all the new solutions in which we are investing. The long-term opportunities remain robust and we are seeing real progress in terms of market demand in our customer interactions."
            ]
      ],
      [
            "Thanks for taking the question. The principal variance in your fourth quarter results versus ours and I think most people's expectations was the higher level of spending in the business P&L and it looks it's on the wireline P&L. During your remarks you talked about a step-up investments in the business services segment to drive growth in the future. So I'm assuming that we've already started to see that in the fourth quarter run rate. I guess what I was hoping to get more clarity on is, what precisely are you spending that on? I mean, if I annualize that uptick it's well in excess of $1 billion of incremental OpEx. So I think there's going to be a lot of interest in where you're spending it and how we should expect that payoff to flow through.",
            [
                  "Let's now move to slide 15 to discuss the wireless results. Total wireless operating revenues increased 3.5% and to $25.3 billion in the fourth quarter, driven by a 2.7% increase in service revenue and benefits from the total mobile protection pricing action taken in the third quarter. The fourth quarter performance was below our targeted range, primarily as a result of higher base optimization into new pricing plans, which we believe is stabilizing and the impact of increased gross adds on our promotional expense that amortized reservice revenue."
            ]
      ],
      [
            "Hans, I wanted to talk on 5G a little bit. You rolled out the new standards-based 5G Home in Chicago. Can you just give us a little bit of color about what difference that makes and how aggressively you're going to lean into this in terms of new markets and households until you get the next generation with the new chipsets? And then related to that, you've got a number of 5G Ultra Wideband devices in your handset mix. Obviously, you're waiting for the iPhone. But how do you see that -- those devices penetrating your subscriber base over the last few months? And what does the pipeline look for new devices with that capability over the next few months?",
            [
                  "Thanks, Brady, and thanks, everyone, for joining the third quarter earnings call. I want to start by saying that I'm very pleased how well the team executed our strategy and operation this quarter. We made a lot of progress on our overall strategy, so I'm very happy with it. Let's start with the network. I think the network team has continued to execute extremely well. I'm confident in our ability to keep winning the third-party awards on the 4G network. We are just continuing to do a really good job there. At the same time, our team is executing on our 5G strategy, and we're now up to 15 markets where we have deployed our 5G Ultra Wideband. Our commitment with 30 markets by year-end is still committed, and we will continue to do so the rest of this year."
            ]
      ],
      [
            "If you don't mind, I was hoping maybe you clarify some of the comments you made around the EPS guidance and some of the drivers. So, you're basically saying that you expect earnings exclusive of the new lease accounting to be similar or effectively flat this year. And I think you indicated that there's essentially about a $0.14 headwind from the ASC 606, you had $0.28 benefit in ‘18. I think that goes to about 14 this year. And I just wanted to clarify. I think you also indicated, there's another say $0.10 to $0.14 coming out of the higher tax rate and the increase in interest expense because of putting spectrum into service. So, all in, those items are $0.24 to $0.28. Is that the point you made?",
            [
                  "After the effect of these items, which we expect to be approximately $0.24 to $0.28 of pressure on EPS growth, we expect our adjusted EPS in 2019 to be approximately the same as our adjusted 2018 EPS, excluding the impact of the new lease accounting standard. At this point, we expect the adoption of the new lease accounting standard to have about $0.01 to $0.02 per quarter headwind impact on EPS in 2019. The 2019 effective tax rate is projected to be in the range of 24% to 26%. We expect cash income taxes to be $2 billion to $3 billion higher due to tax benefits that were realized in 2018 that we do not expect to repeat this year."
            ]
      ],
      [
            "Hi, good morning. Thanks for taking my question. I wanted to flip over to Optum. On OptumInsight, backlog grew nicely, I think previously the target there had been in the $15 billion to $16 billion range to end the year you will need a pretty strong fourth quarter to get there. I wondered if that’s still the view and then OptumInsight has also been running at very attractive margins kind of above the long-term target. Is that sustainable or maybe asked a different way? Are we looking for a kind of higher target range? Are you revising the range up or is there some reason why that might moderate back down into the 16% to 20% range? Thanks.",
            [
                  "Thank you, Dave. Optum’s third quarter included continued growth, strong margin than earnings and further strategic advantage. Third quarter revenues grew nearly $2 billion to approach $23 billion, an 8.4% advance over last year. Optum’s earnings from operations of $1.7 billion were again well-balanced with each segment producing double-digit percentage growth in operating earnings. A nearly 16% increase in Optum’s earnings was driven by the combination of strong revenue growth, business expansion and strengthened operating margins for both OptumHealth and OptumRx and a steady 20% operating margin at OptumInsight. Overall, Optum’s operating margin of 7.4% increased 70 basis points sequentially and 50 basis points from last year’s third quarter. OptumHealth grew revenues over 21% year-over-year as it expanded to serve approximately 9 million more consumers over the past year. OptumHealth has among the broadest reaches in healthcare directly serving 90 million consumers."
            ]
      ],
      [
            "I also wanted to share my best wishes to Lowell, good luck with your retirement. Good to hear the news about Houston; you've talked about a $30 million plus opportunity for the residential broadband, can you just help us think about the pacing of that? How are you thinking about the initial timing of the rollout? How many markets we'll see in terms of pops covered over the next 12-24 months? And then on the mobility side, you're starting to talk about that a bit more, we've heard some of your competitors talk about how many markets to launch this year; how rapidly do you think you're going to roll that out? And is that all going to be microwave or you're going to use some lower balance [ph] for the mobility 5G? Thank you.",
            [
                  "We continue to be the clear leader in 4G performance driving further innovation, growth opportunities and implementing new network capabilities that will further enhance our customer's experience. We have made the strategic invest in millimeter way [ph], spectrum that enable ultra-wideband 5G services. Our fiber [indiscernible] would build out on the way in over 50 markets outside of our higher ILEC footprint that will allow us to take full advantage of the many used cases that will come to bear in 5G. Our Intelligent Edge Network design allows us to realize significant efficiencies by utilizing common infrastructure [ph] in the core and providing flexibility at the edge of the network to meet customer requirements. Our Oath and IoT assets will provide a platform for us to participate in the use cases that 5G will enable. We're rapidly approaching the launch of our first use case for 5G with a roll-up of residential broadband services. As you know, Sacramento and Los Angeles are two of four initial commercial launch market and you heard Lowell earlier announce Houston few minutes ago. News and updates on our full [ph] market will be provided soon."
            ]
      ],
      [
            "First on the strategic side; as I listened to the management commentary over the past year -- is the underlying goal for Verizon to become a leading provider of broadband in the home and on the go across the country? And if this is the direction how long would it take and how much can be driven by internal investments versus possible M&A? And then just one thing on the business trends; postpaid phone were at the industry level has risen more than twice the rate of population growth, do you have any thoughts on what's driving this change and the sustainability for postpaid phones at this new level of growth? Thanks.",
            [
                  "If I look at where we are today, once again the company is well positioned for the future. Our financial and operating results for the first half of 2018 are strong as evidenced by our service revenue, earnings and cash flow growth. Verizon has 100% ownership of our wireless business and it's industry-leading network and customer base. We have driven the 5G ecosystem by pushing the industry to adopt the next-generation several years ahead of original expectations. And we are positioned to be the clear leader in the deployment of 5G services based on our technological expertise, asset base, engineering talent and spectrum portfolio. This leadership position is attracting opportunities in areas such as over-the-top TV, smart cities, transportation, education and healthcare; just to name a few."
            ]
      ],
      [],
      [
            "And then the second on the cash flow guidance, the $3.5 billion to $4.0 billion cash flow benefit, is that a sequential year-over-year benefit or is that a benefit relative to what you're expecting to pay in cash taxes in 2018. And then Lowell, if I could just ask, you've done a number of things on fiber both organic builds in terms of Boston for instance, acquisitions of XO and then more creative partnerships like on the WOW front.",
            [
                  "In terms of tax legislation we expect the savings to generate a net $3.5 billion to $4.0 billion uplift to cash flows from operations in 2018 and is expected to yield a $0.55 to $0.65 increase to EPS in 2018. [Net of our] employee initiative and contributions to the Verizon foundation that Lowell mentioned earlier. The resulting 2018 effective tax rate for Verizon is projected to be in the range of 24% to 26%. Lowell stated earlier there are internal capital decision process and return objectives have not changed. We are consistent and methodical in our allocation. We expected consolidated capital spending to be between $17.0 billion and $17.8 billion including the commercial launch of 5G. With that I will turn the call back over to Brady, so we can get your questions."
            ]
      ],
      [],
      [
            "I wonder, Matt, if you could just talk a little bit more believe capital spending for the year; you’ve obviously talked a about densification support, but what range is quite wide; you reiterated that today wireless was quite like this quarter. And so how should we think about mid range low end, high end and the trajectory through the year? And we were certainly getting a lot of questions about your Corning deal, $1 billion is a big contract. But I think Lowell was making the point that that’s consistent with your overall capital spending needs. So is this something where it’s consistent with spending or expecting, or have been doing and continue to do? Or is this a real step up in your fiber spending? Thank you.",
            [
                  "Let's move next to slide 12 to discuss network and technology. We consistently invest in our networks to ensure that overall quality and capacity remains ahead of demand. Capital spending of $3.1 billion in the quarter was largely network related to maintain leadership in our markets. Fiber is a critical component of our network strategy and next generation deployments, as demonstrated by the success of our densification initiative. Earlier this week, we announced the strategic agreement with Corning with whom we have a long-relationship to supply optical fiber and hardware solutions of at least $1.05 billion from 2018 to 2020. This investment ensures that we have adequate supply of fiber."
            ]
      ],
      [],
      [
            "Thank you. It so great that Jo Ann is on the call. So I think this is going to be a lot of questions for you, Jo Ann and I am going to continue along. This is the best upfront in recent memory. And I would love to get your take on what's going on in the overall market? Where the dollar is coming from, -- is it coming from Digital? Or somebody losing share and how has CBS a share of advertising dollars changed over the last few years? Who do you see as your biggest competitor in the markets? Is it -- I mean I don't want to put words in your mouth. And then so far you've been really good at avoiding any specifics on CPM growth overall and volume. If you could give us any color on that. And you kind of alluded to targeting if you could just maybe talk about where you are in targeting on linear.",
            [
                  "Now, before I turn the call over to Jo Ann, I want to touch on an important announcement you've likely heard about this morning. And that is our new powered agreement deal with AT&T, we are very pleased to have achieved an agreement that recognizes what CBS brings to the table. We have now successfully completed three very significant carriage deals one with AT&T, one with Altice, and one with Nexstar in the span of less than two weeks. As a result, we remain solidly on track to achieve the retrans and reverse comp targets we laid out for you previously. So we had a strong first half of 2019 and we have many clear proof points that our strategy is working. We are growing our retrans and reverse comp. We are accelerating the growth of our direct to consumer businesses. We are pursuing new opportunities in audience monetization and we are expanding in the international marketplace, where we see our biggest opportunity over time, particularly in direct to consumer. And all of this is driven by our investment in must-have premium content."
            ]
      ],
      [
            "Thank you very much. Just sort of staying on the digital advertising topic, when we look at CBS All Access, can you give us a sense of what the revenue mix is an All Access between advertising and some revenue and in which revenue stream you more excited about and maybe how big of a step-up, are you seeing this year given the strong demand in advertising. And then just a follow-up, I think on your announcement on moving into the kids programing and All Access. I may have missed it, did you say when that was going to be introduced and will be see a step up in marketing spend around that to attract new demo?",
            [
                  "And another driver for us, digital. Digital sales in this year's upfront shows significant pricing increases from 2018 levels. Thanks to our leadership position and OTT, we are seeing is greater share of premium digital video budgets than ever before. Our direct consumer offerings including CBS All Access CBS.com CBSN and many of our other sites are giving brands extended unduplicated reach as well as the safe and transparent option in their media planning. So we are combining the power of the Number 1 network from beatable scale with the reach engagement and targeting of our leading digital properties to give advertisers a one-stop option to build awareness ignite interest and drive sales. In a rapidly changing media landscape, the success of the CBS ad sales team is built on the strength and stability fueled by innovation and creativity. By capitalizing on our deep and establish relationships and taking a personalized an integrated approach with all our clients not only are we growing revenue. We are also finding new and impactful ways to deliver value to brand in every category across our linear and digital properties."
            ]
      ],
      [],
      [
            "Thanks so much. I want to go back to the -- but first, I wanted to say Anthony to bang-up job in that Safe Harbor. So Jo Ann, I wouldn't say let the market. So who won and what was your strategy around inventory? Upfront pricing was strong, but you have to comp big scatter pricing increases that you have the season. So do you sell a lot of inventory to strong upfront or you hold back and hope the scatter market stays strong and-or in that your ratings are good and I got a follow-up for Joe.",
            [
                  "Now, before I turn the call over to Jo Ann, I want to touch on an important announcement you've likely heard about this morning. And that is our new powered agreement deal with AT&T, we are very pleased to have achieved an agreement that recognizes what CBS brings to the table. We have now successfully completed three very significant carriage deals one with AT&T, one with Altice, and one with Nexstar in the span of less than two weeks. As a result, we remain solidly on track to achieve the retrans and reverse comp targets we laid out for you previously. So we had a strong first half of 2019 and we have many clear proof points that our strategy is working. We are growing our retrans and reverse comp. We are accelerating the growth of our direct to consumer businesses. We are pursuing new opportunities in audience monetization and we are expanding in the international marketplace, where we see our biggest opportunity over time, particularly in direct to consumer. And all of this is driven by our investment in must-have premium content."
            ]
      ],
      [
            "Hi there, maybe two on OTT. So Joe, one of your competitors is talking about putting together a bundle of three services there, you guys also own a number of services. Could you talk about your thinking about the power of bundling your both ad-driven and subscription-driven services together as a marketing tool? And then staying on the subject of marketing, as you think about some of these new Apple plus Disney Plus some new competitors coming to the marketplace, how does your marketing strategy you have to change because I lost on nobody that you've been in the market with All Access for four years and now you're introducing Kids right as Disney comes into the market, right on top of them. So it feels like you reacting a little bit two new entrants. So could you talk more generally about how your marketing plans need to change market competition certainty?",
            [
                  "Now, before I turn the call over to Jo Ann, I want to touch on an important announcement you've likely heard about this morning. And that is our new powered agreement deal with AT&T, we are very pleased to have achieved an agreement that recognizes what CBS brings to the table. We have now successfully completed three very significant carriage deals one with AT&T, one with Altice, and one with Nexstar in the span of less than two weeks. As a result, we remain solidly on track to achieve the retrans and reverse comp targets we laid out for you previously. So we had a strong first half of 2019 and we have many clear proof points that our strategy is working. We are growing our retrans and reverse comp. We are accelerating the growth of our direct to consumer businesses. We are pursuing new opportunities in audience monetization and we are expanding in the international marketplace, where we see our biggest opportunity over time, particularly in direct to consumer. And all of this is driven by our investment in must-have premium content."
            ]
      ],
      [],
      [
            "Thank you. Good morning. I want to touch on the direct-to-consumer streaming stuff and obviously take advantage of Jim being on the call. First, Jim, could you talk about the AVOD Opportunity? I mean we all know CBS All Access and the subscription businesses you've been building are doing quite well with Showtime. But AVOD is – there's a lot of focus on that marketplace today. It was interesting that you said you're basically sold out all the time. So just talk about what you're doing to try to drive that business, I don't know if you'd be willing to size it for us in terms of ad revenue or what kind of growth rates you're seeing and how do you create more impressions beyond just a driving engagement?",
            [
                  "With the number one television network and they growing suite of ad-supported CBS branded streaming channels we offer our clients a range of opportunities that is unparalleled. We see big opportunities in advertising because of all the new ways we now reach consumers. And technological advancements in measurement continue to get us closer to realizing the true value of our audiences. For example, out-of-home viewing boosts our ratings meaningfully. And these viewers are not yet included in the C7 currency. But as we've seen time and time again, when we move from live to C3 to C7, it's fair to expect out-of-home consumption to be included and it's only a matter of time that all consumption is measured. By the way, with all this talk about advertising you may be able to guests which CBS executive that is scheduled to be our surprise guest on our next earnings call."
            ]
      ],
      [],
      [
            "And the clarification, Christina, is on the multiyear double-digit EPS guidance, should we assume as also double-digit EPS growth in each of those years? And how much of those growth is, if any, should we assume is driven by buybacks? And lastly my question is, Joe, does your data and research suggests CBS All Access would be dominated by cord-cutters in core networks? Or do you think consumers of the live TV bundle will also subscribe? And if so, like how much more content do you need to make it attractive for those households? Is there anything beyond content that you're doing to drive growth at CBS All Access? Thank you so much.",
            [
                  "CBS All Access and Showtime are growing so rapidly that we're prepared to increase our future projections as well. Six months ago, we told you that our goal was to achieve 16 million subs from these two services by 2022. Today, we are raising that target to 25 million subs by 2022 more than triple the number we have now. And that doesn't include any subs from our international direct-to-consumer platforms which represent a significant additional opportunity for us, and it doesn't include our rapidly growing ad supported direct-to-consumer channels including CBSN, CBSN Local, CBS Sports HQ and ET Live all of which are contributing to make CBS All Access a unique and more robust content offering."
            ]
      ],
      [
            "Okay. Thanks on that. And then, Les, you did mention the subscribers growing across your business which is healthy. But if I think specifically about your station subscribers which are traditional MVPDs and the virtual MVPDs, with the launch of some of the new MVPDs over the last quarter or two, have you seen an improvement in that trend as a stand-alone? What are you seeing there at this point?",
            [
                  "I want to make one key point right up front from here that truly illustrates our momentum. In an era where others are concerned about losing subscribers caused by cord cutting and other matters, CBS Corporation is growing its subscribers. That's right. When you combine all of our paying subscribers across traditional MVPDs, virtual MVPDs and our direct-to-consumer services, our overall sub base is growing at both CBS and Showtime."
            ]
      ],
      [],
      [
            "Great. And then, Joe, I think if you look at the full year, licensing and distribution was up almost 8%, I think it’s the highest growth rate since maybe 2013. I think, another concern in the market is the syndication business is sort of dead. Maybe you could just talk about the drivers of licensing and distribution for the year. How did international do, domestic, digital, what’s making that business start to grow faster than expected?",
            [
                  "This momentum is taking place at a time when two other key positive developments are happening as well. First, we’re just beginning to benefit from our strategy to dramatically increase the output at our in-house studious. During the year, we produced 64 shows for 12 different buyers from the world of broadcast, cable and streaming. This expanded slate of programming is being monetized across platforms and around the globe, resulting in growing content license fees. Just yesterday, we announced a multiyear deal with Amazon to license The Good Wife in Europe, Asia and Latin America, representing a whole new opportunity to take content we launched on All Access here in the U.S. and license it internationally. And the second positive development is that we’re seeing extremely strong growth in scatter pricing across all day part, up nearly 40% in primetime, daytime and late night. Plus as more and more viewing happens on digital platforms, we’re just beginning to benefit from better CPMs as a result of more targeted digital advertising. So, whether it’s launching new direct-to-consumer services, negotiating with distributors, licensing our content around the world or selling into advertises across platforms, we are operating from a position of great strength, thanks to the size of our audience and the demand for our content."
            ]
      ],
      [],
      [],
      [],
      [],
      [
            "Thanks. Good afternoon, guys. Les, it seems like All Access has continued to be a strong growth driver. I think it's in your 20% growth of affiliate subscription revenues. Can you just talk about how that performed once the NFL season ended? I didn't know if churn spiked at all, how The Good Fight played. And it seems like you're getting close to 1.5 million or so of subs. I don't know if you're willing to humor us with a new disclosure, but I thought I'd try. And then I have a follow-up for Joe, a quick one.",
            [
                  "I'm pleased to report that CBS delivered a very healthy first quarter. EPS was $1.09, up 15%, representing the 29th consecutive quarter of EPS growth. And revenue came in at $3.3 billion, which was quite an achievement because we were going up against a quarter a year ago when we had the Super Bowl and an extra NFL playoff game. When you exclude those two games, revenue would have been up high single digits for the quarter. CBS' strong performance is the direct result of our clear strategy to diversify our revenue."
            ]
      ],
      [
            "Hi guys. Thanks. Cross-border growth looked like it accelerated a bit. I think 8% in October. And there has been questions around macro trends and potentially slower cross-border, just globally in September, October from different parts of the ecosystem and just doesn't look like you are seeing that. So maybe just if you can give us some comment on what you are seeing in cross-border trends a bit more granularity? And then Vasant, it also looks like revenue growth accelerated in the international fees. I know there was pricing earlier in the year on cross-border, but FX vol had weighed some of that down last quarter. So are we now seeing was that better this quarter? Are we seeing the full flow-through of pricing there? Thanks guys.",
            [
                  "As it relates to the 2020 fiscal year, our financial outlook includes annual revenue growth of low double-digits and mid-teens adjusted EPS growth on a constant dollar basis. Before I turn it over to Vasant to go into a lot more details on our results as well as our 2020 outlook, I want to note that as I look ahead, I am excited about the multi-year journey we are on to get more involved in all money movement and I can't recall a time in Visa's history with so much opportunity ahead. To that end, we want to spend some time with all of you discussing our future growth. So we are going to host an Investor Day on February 11, here in San Francisco."
            ]
      ],
      [
            "Hey, it's Michael Bilerman from Citi here with Manny. I wanted to ask a question just about the cash hoard and little bit on the forces and uses of that cash. As I go through you obviously a lot of cash coming in from the condo sale for 220. You now have another $1.2 billion from this outstanding retail deal that you completed during this quarter. You had another $1.8 billion to come as you deem preferred in the few years from putting mortgage debt on the properties. And that's on top of almost $1 billion of existing cash on the balance sheet. So it's a lot of money.",
            [
                  "As I said the deal is spot on with our published NAV at about $7 per share accretive to our stock price. Think of it this way. We started with $5.3 billion of assets subject to $860 million of debt or $4.5 billion of equity at NAV which was valued on the marketplace at you pick the number say as 30% discount or $1.35 billion debt. We ended up with $1.2 billion of cash and $1.828 billion of preferred equity or $3 billion of financial assets plus 51% of the common equity and the continuing upside in the property. All-in-all we are much much better off. We will recognize a $2.6 billion financial statement gain in the second quarter. The tax gain is estimated to be $735 million. The math in my letter indicates that there will likely be a capital gain distribution at year-end. Michael Franco quarterbacked our execution team on this deal. He and his team did a superb job."
            ]
      ],
      [
            "Okay. And then a final question, this might be for Joe. But at 220 Central Park South. You had on your balance sheet condo units ready for sale at $99 million and that's lower than what you've already closed in January. So I'm wondering, if this is a good indicator of what you plan to close on over the next quarter going forward?",
            [
                  "We have begun closings that are 220 Central Park South super-tall condominium project. In the fourth quarter, we closed 11 units aggregating $222 million with a $67.3 million after-tax gain. And we have already closed in just the first five weeks of this year, another $290 million. Closings will continue throughout 2019, as we climb up the building. And the last of the 27 large full floor apartments in the tower is now committed and under contract. I'm guessing that this is the most successful project ever, anywhere."
            ]
      ],
      [],
      [],
      [
            "Joe at the end of your comments you gave some detail on Central Park South, maybe I’m slow I just want to make sure I'm clear on this. It looks like the budget for that project went up about $150 million. I don't know if it's safe to assume you still think the sellout is going to be about $3.2 billion. Could you help bridge that how they’re still with those numbers they’re still 900 million after the - and taxes and everything?",
            [
                  "One word on the NAV, needless to say 220 Central Park South is a component of that NAV. We have used $900 million for the estimated after-tax profit coming from that job. That has not changed. If you go to last year's the same $900 million. We update that based upon the transfer pricing portion of Vornado's regular dividend, cash dividend to shareholders which is represented by fees and interest charge to 230 Central Park South."
            ]
      ],
      [
            "And then Joe just want to come back to this NOI, you talked a lot about flattish, I understand the retail this year was 3.24, the bottom end of 3.09 for 2018, in the fourth quarter you’re actually at 3.33 annualized but put that aside. I am more interested on the office side of the business, the schedule that you had in the prior stuff on Page 9 still had about $36 million of signed leases incremental NOI that was on the come. And so I don’t why the office business would be effectively flattish?",
            [
                  "For the purposes of what I just given you, it's a worst-case scenario and we don't assume any new leasing and a retail portfolio. We are projecting 2018 interest expense including our share of partially owned entities to be approximately $16 million or $0.08 per share higher than in 2017 primarily due to a $15 million increase from estimated higher average floating-rate. As a result of these items, we expect 2018 NOI and therefore FFO on a comparable basis to be flattish."
            ]
      ],
      [],
      [
            "Hi, Good morning everyone. So last 12 months, you had 65% incremental margins. They are over your company norms and your target levels. It looks like you have good cost control, you have volumes to support the fixed cost absorption, pricing in the mid-single digit range, you've got you're stripping out of the way this quarter. Is it possible to maintain a 65% run rate given the compounding profitability characteristics of Aggregates? I'm not asking you to commit to it of course, taking into account all your comments on guidance, but I'm curious what would be needed? And is it possible to sustain an elevated level of profitability?",
            [
                  "Thanks and good morning to everyone. As Tom mentioned, our trailing 12-month same-store incremental aggregates flow-through rate of 65% was quite good, while price is certainly an important driver of this metric, I also want to touch on the impact of our operating cost performance."
            ]
      ],
      [
            "Great. Thanks for that color, Suzanne. That was good. And then lastly for me and I'll pass it on is, you mentioned, Suzanne, capital spending, operating and maintenance CapEx dialing that back a little bit from $250 million to $225 million, and I think growth from $350 million to $300 million. And do you have any preliminary view, and I know there was some commentary, maybe a quarter or two ago, but just any update on how to think about those two pieces of CapEx as we look into 2019?",
            [
                  "After further review of our 2018 capital spending plans, we now anticipate that operating and maintenance capital expenditure will be $225 million rather than $250 million. Our growth CapEx will reduce from $350 million to $300 million. These capital spending reductions are part of our ongoing view to reevaluate the merits and timing of the individual projects. Using these assumptions, we now expect our 2018 after-tax cash flow from earnings to be approximately $810 million."
            ]
      ],
      [],
      [
            "...I'm just trying to understand the second half guide and you guys talked about it a couple of different ways as far as what the true like-for-like pricing is. And so I think, throughout that, it was 3% to 4%, and 80% of your market. So, when we're looking at the price guide for the second half, what would you say as far – is the mix impact in the geographic mix impact in your second half pricing commentary? Is it the same, has that – is it diminishing as some of those, like the California markets, come back just trying to get at really what the underlying change is there?",
            [
                  "Second, let's talk about pricing. Geographic mix impacted our total reported average selling prices in the second quarter. Excluding this mix impact, average aggregate selling prices improved 3%. Given the continuing recovery and public demand, geographic and product mix may continue to affect reported average sales prices for the next few quarters. But let me tell you, I'm not concerned about this mix effect. It's good for the business to sell a full product mix and we're focused on driving prices higher for all product types. Please don't base funds (00:07:45) across all geographies. We like the pricing trends we're seeing in our backlogs. And project pricing continues to strengthen, and will throughout the year. We're pressing for second half price increases in many of our markets across all customer segments."
            ]
      ],
      [
            "I think, obviously, we're pleased with Q1. It was a good start. I thought that our folks performed even then with some headwinds of weather in the first couple of months. Pricing is, I think, I alluded to will grow throughout the year. We had, you know, some January price increases, with some April price increases, and then as we bid work, particularly on the base and some other bid work, it will move up throughout the year. And then John's comment obviously about the Southeast being a little slow in the first quarter and coming back and some of our strongest markets will add to that.",
            [
                  "Thank you, Mark, and thank you all of you for joining our call today. Our first quarter operating performance represents a really strong start to the year. Results were in line with our internal first quarter plans despite challenging weather and higher than expected diesel costs. Leading indicators for construction activity in Vulcan-served markets are very encouraging. Recent price increases have been well executed and we expect materials pricing to improve further throughout the year. We're also putting recent cost headwinds behind us. For ton margins in our Aggregates segment improved year-over-year and we expect stronger gains over the balance of the year. We are reiterating our full-year projections for net earnings and EBITDA."
            ]
      ],
      [
            "I guess, my first question is on investment income. First, the fixed coupon income has been ramping up $3 million, $4 million, $5 million a quarter each quarter throughout the year. But the investment assets aren't growing that significantly. So I assume that's pickup in short-term yields or you're rearranging on the longer side too. I'm just sort of curious what's driven that and whether that might continue?",
            [
                  "In part, this reduction was offset by increased underwriting expenses from the addition of new operating units. In addition, Berkley One, our high net worth business began underwriting risk in Illinois during December, and it's quarterly expenses will be reflected in the first quarter of 2018. Historically, the average for new operating units, as Robert referenced, defined at less than 3 years of operation, contributed approximately 0.5 expense ratio points. This brings our combined ratio for the fourth quarter of 2017 to 94.9%, unchanged from the prior year. The core portfolio investment income increased approximately $14 million compared to a year ago led by fixed income securities with an annualized yield of 3.5% and real estate income. Investment funds contributed $17 million to net investment income, which declined $21 million from the prior year as energy prices were below the prior year's level. We've highlighted the potential variability that may arise in the fund performance on a quarterly basis. We anticipate the energy funds performance in the first quarter of 2018 may approximate this quarter's energy funds result."
            ]
      ],
      [
            "Hi, thank you. Rob, I was hoping we can go back to your opening comment about the some of the parts not equaling the whole and it seems as if maybe half the losses or maybe more are missing. And do you lay that what the possibilities could be and I agree with those? I guess I wanted to ask you sort of the next part which is what happens next, if it is really isn’t only 50, maybe 60, not a 100, how much has that dampened the pricing momentum. And if let’s say, it is 100 and everyone is late, we are used to seeing average development on these type of events, but not by 2x. So, it seems a little fishy I guess if that’s really the case. But it feels look like people are trying to have, they are taking you to report low losses and still get pricing and you really think things work that way?",
            [
                  "Switching over to the traditional topics, so what’s going on in the market? From our perspective, obviously, again, Q3 very active, unusually active and at this stage, there are probably two glaring questions flashing in bright neon at all of us. One question would be so when you tally up all these losses in the third quarter and you hear the number that’s checked around, how come all of the parts if you will are not equaling or adding up to the whole. When you look at the numbers that have been announced or pre-announced as it relates to losses during the third quarter and again you looked at the projected whole, the parts are not equaling the whole. Obviously, there could be a couple of different reasons for this. One is that it will turn out the projected whole turning out to be something less than expected; number two, alternative capital and other market participants that have not announced, it’s going to prove that they have more exposure than perhaps some people had originally expected; or number three, many market participants are just proven to be more optimistic than will prove to be reality. I am not sure if anyone knows for sure it could be some combination, but certainly the parts not adding up to the whole has made us scratch our head."
            ]
      ],
      [],
      [
            "Thanks. And congrats on the quarter. I wanted to start with a question on operating cashflow and the guidance there. So using the midpoint of the prior guidance, it looks like the expectation for 2019 went up by $350 million on a GAAP basis, and it went up about $150 million on an adjusted basis. Pat, can you just help us understand what drove these increases in operating cash flow and the outlook?",
            [
                  "At a high level, we had a good quarter with strong operating performance, margin expansion, solid cash flows from operations, and based on our second Q performance, current backlog in our assessment of key markets we're raising our cash flow guidance for the full year to approximately $900 million and our EPS guidance is now $4.10 to $4.20. I'll talk more about our market expectations for both Freight and Transit, but first, Pat will provide you with a deeper dive into the financials. Pat?"
            ]
      ],
      [],
      [],
      [
            "Hey, thanks. Good morning. I was wondering if you could talk to the cadence of EPS in the second half of the year. I think Pat reminded us that you do have some seasonality in your Transit business from 2Q into 3Q, but this is kind of a different ballgame due to the fact that with GE and there is obviously more kind of project timing that influences numbers. But just curious if you could give us maybe a little directional guidance in terms of how we expect 3Q and 4Q EPS to play out?",
            [
                  "Thank you, Rafael. As you can see from our press release this morning, we are going to discuss both GAAP and adjusted numbers, so we encourage you to review the reconciliations we provided. We continue the momentum started in the first quarter and delivered solid operating performance in the second quarter, which was the first full quarter of results since completing the merger between Wabtec and GE Transportation. Today, we updated our guidance for sales for adjusted income from operations for adjusted EBITDA, for adjusted EPS and cash flow from operations, which shows that our business is performing up to expectations."
            ]
      ],
      [],
      [
            "So, I wanted to go back to the $250 million of expected synergies over four years. You had nice detail on the slide, but wanted to give it a kind of a sense and more color in terms of how much of those synergies are expected from the cost side of things. And then how much of the $250 million is potentially driven by the sales synergies?",
            [
                  "Our opportunities to generate synergies are significant, they're worldwide and we've defined those as $250 million on a run rate basis with significant tax benefits that will drive value creation. And I honestly believe that as we explore in more detail our opportunities around the world, we'll find more opportunity through the creative and capable management team that we have in place."
            ]
      ],
      [
            "Hey, thanks. Good morning guys. I wanted to start with the revenue guidance that --so you have guys done to give or take $2.2 billion of revenue first half of the year. Pretty much we always see better revenue in the second half than the first half when you've got a backlog like this. So, you know you should be doing north of 5.4 or higher when guidance is $4.2 billion-- how many bridge the gap there and what might be getting worse in the back half for the year?",
            [
                  "Thank you, Tim. Good morning, everyone. It's good to talk with you today. I am happy to report we exceeded slightly our financial targets in second quarter and our now comfortable increasing our guidance for the year to revenues of about $4.2 billion and adjusted earnings per diluted share of about $3.85."
            ]
      ],
      [],
      [
            "If I can just sneak one more in on the PTC, I know you’re guiding 5% up year-on-year, 3.54% for 2018. Just looking out to 2019, I know you don’t have guidance out there, but presumably, a lot of investors are focused on what happens post the deadline. Any way for investors to kind of think about, is there a hole, is there not a hole, do you anticipate having the mark of revenue growth from $50 million to $100 million. Is there any kind of broader comments that you can give on 2019, post the deadline?",
            [
                  "Thanks Pat. As I mentioned previously, we affirmed our guidance for the year based on our first quarter performance and our outlook for the rest of the year. We expect full year revenues of about $4.1 billion, with adjusted earnings per diluted share of about $3.80, excluding restructuring and integration charges compared to 2017. This would represent revenue growth of about 6%, and adjusted EPS growth of about 11%. Given that we slightly exceeded our first quarter expectations, we hope the guidance proves to be conservative. We expect to generate cash from operations in excess of net income for the year."
            ]
      ],
      [],
      [
            "Good morning. Thank you for taking my question. I want to ask a broader question about the margin guidance for 2018. So, you guys are calling for roughly 6% revenue growth and meaningful part of that should come from the freight aftermarket business which as you noted earlier is a high margin business. And I understand there is some transitory project cost that are continuing in 2018, but that there should be subsiding towards the back half of the year. So, the margin guidance given where the growth the top line growth is coming from seems to me just a bit light at 40 basis points. How much of that is related to the SG&A cost that you just mentioned in the previous question?",
            [
                  "Looking at our consolidating operating income, it was about $91 million. As mentioned in our press release this morning and in our preannouncement a few weeks ago, this included contract adjustments of $24 million and restructuring and integration expenses of about $18 million. The restructuring and integration expenses were for ongoing cost cutting actions and were included in both cost to sales and SG&A. The contract adjustments reflect higher than expected cost on certain existing projects and were included in the cost-of-sales line. With these contract adjustments, we've completed the review of our project portfolio and believe our U.S. and this reflects the reality of the current status for these projects. If you exclude the contract adjustments, and restructuring expenses, operating income was $133 million or about 12.4% of sales. That was lower than our target for the quarter and is due mainly to the negative product mix and some higher project costs in the UK. Going forward, our 2018 target is about 13.5% EBIT margin with an improvement expected during the year."
            ]
      ],
      [
            "Got it, that's very helpful. I think that the freight business the $9 million organic sale decreased in the fourth quarter. When you were thinking about your 2018 guidance, where does this number, this decline to the moderate, does it stay stable or could there be organic growth in 2018?",
            [
                  "Thanks, Ray. Sales for the fourth quarter were $1.08 billion and when you look at our segments the transit segment sales increased about 70%, this increase was due to acquisitions which contributed about $192 million of sales, we had organic growth of about $88 million and a favourable FX impact of about $13 million. This is the second quarterly grow we’ve seen organic sales growth in transit which demonstrates that our record backlog is starting to kick in."
            ]
      ],
      [
            "Hello, I've got three quick cash flow questions and then couple of extra questions please. How much did you spend in cash terms on restructuring and integration in 2017 and what would you expect for 2018? And then is working capital where you wanted to be or can improvements be made? And then the final one on CapEx. You used to spend about $50 million a year before Faiveley, now you're spending 120 in this coming year. Is that a permanent increase and what do you spending it on?",
            [
                  "As in prior years, I just want to remind everybody that our cash from operation tends to increase during the year for a variety of reasons. We expect to see an only a slightly positive number in Q1 with improving to build throughout the year. Just a couple of miscellaneous items that to help you all, our depreciation for the quarter was $70 million compared to $40 million in last year’s quarter and for the full year of 2018 we expect it to be about $70 million. Amortization expense was $9.5 million compared to $6.6 million of last year's quarter. And for the year of 2018, we expected to be about $38 million."
            ]
      ],
      [],
      [
            "Okay, that's helpful. And then secondly, I wanted to follow-up on cost cuts in the freight segment and the potential for additional cost cuts going forward. If we see an environment where rail volumes start to moderate a little bit and that continues into next year, the build rates for rail cars and locomotives in North America are blasted [ph] down in 2018. Do you still have opportunities to take costs out of that freight segment? And if so, is there any way you can help us think about what's left in terms of the remaining opportunity?",
            [
                  "On the freight rail side, we continue to face some short-term challenges. But our freight revenues and backlog have been stable for the past four quarters which is a positive indicator. In North America, freight rail traffic continues to grow although we still see a lot of rolling stock in storage. About 20% of freight cars and 15% of locomotives are still in storage. As a result of these storage figures and railroads own cost cutting efforts, we have seen only a slight pickup in the U.S. aftermarket business. Most of that pickup has been in friction products although we are beginning to gain business in other service areas. With winter coming and kicking into effect in the next few months, we could see more demand for typical repair and service work of components. The U.S. OEM market for cars and locomotives remain sluggish and will likely be flat or slowdown next year."
            ]
      ],
      [],
      [
            "And then maybe to follow up on that second question that I had, it seems like between signaling, freight aftermarket and the overhaul business that’s probably higher margin business. Is it fair to say that $250 million of revenue carried a more favorable margin profile than consolidated averages?",
            [
                  "Our freight sales decreased 13%. Lower organic sales, mainly from signaling and train control, freight and OE and aftermarket sales, were down about $93 million. There was a small FX impact of about a negative $3 million and then we had an offset from acquisitions that contributed an additional $44 million. Freight sales have been in the range of about $340 million to $350 million for three quarters in a row now. Our freight backlog has increased for the third quarter in a row. Those things I think are a positive indicator."
            ]
      ],
      [],
      [],
      [
            "Can we start just on Faiveley? Is there any way where you can give us a number for and how much revenue in the quarter was from Faiveley and maybe how much operating income or pre-tax income was from Faiveley? And then of the about $15 million to $20 million of synergies, how much you've realized so far?",
            [
                  "Our operating income for the quarter was $115 million. This included transaction expenses of about $8.9 million related to the Faiveley acquisition. Of this, $3.4 million was a one-time purchase price accounting adjustment and included in cost of sales, and the rest is reflected in the SG&A line. If you exclude these expenses, operating income was $124 million and about 13.5% of sales. Going forward, we expect SG&A to be about $120 million per quarter. Engineering expense and the amortization were up mainly due to the Faiveley acquisition, and we expect similar run rates for the rest of the year."
            ]
      ],
      [],
      [],
      [],
      [],
      [
            "So, two things, so, one, as we think about sort of in the rest of retail, a lot of the sort of fears that existed and what companies ultimately have done and I’m thinking about Walmart and Home Depot and some of the more traditional guys, they have basically pursued one sort of omni-channel approach and I think you guys have talked a lot about technology and investment today. But two, there’s just been in general a big downsizing of boxes in a lot of different areas and sort of a consolidation in the industry. That’s the one thing that’s sort of lacking here, obviously, you guys are closing more stores than what we saw in the past. But how do you think about sort of the state of pharmacy and the competitive landscape, because if we think about what’s driving possibly some of the reimbursement pressure outside of lower brand, some of it is still the fact that we’re over boxed across the U.S., maybe by a substantial amount. And so how do you think about that in the context of what you can control and what you can’t control and how you expect some of the smaller peers, I guess, to sort of play out over the next couple of years?",
            [
                  "Thank you, Gerald and hello everyone. I want to acknowledge upfront that this has been a very disappointing quarter for us. There is nothing entirely new in what we have seen impact our business during the quarter. Let’s say, a number of the trends that we had been expecting and preparing for impacted us significantly more quickly than we had anticipated. We found ourselves facing a combination of increased reimbursement pressure in the quarter, lower generic deflation, lower brand inflation and lower than anticipated benefits from our work to refresh and renew our retail offerings, primarily in the U.S. Of course, the pharmacy trends are not only impacting our business, they are impacting the overall market and will likely continue to do so over the coming months."
            ]
      ],
      [],
      [],
      [],
      [],
      [
            "And then George, one just quick clarification question on the tax savings; I'm not a CPA, so I won't admit that I'm an expert here. But if you think about the difference between the original $200 million cash tax benefit, it's led to about $0.30 to $0.35 based on your previous guidance. The guidance for the midpoint in terms of the official change was $0.37, you increased that tax benefit by $150 million, how do we think about the bridge in terms of those two numbers?",
            [
                  "Finally, turning to guidance for the full financial year. We now expect adjusted diluted net earnings per share to be in the range of $5.85 to $6.05. Our guidance now incorporates the U.S. tax law changes. The expected benefits are now marginally higher than the $0.35 per share upper end of our previously indicated range. As we said before, we do not expect Rite Aid to significantly impact this years adjusted diluted net earnings per share, and as usual, this guidance is based on current exchange rates remaining constant for the rest of the fiscal year."
            ]
      ],
      [],
      [],
      [],
      [
            "Bob, I want to ask you about -- actually, Bob and Christine, about Fox. Now that it's closed and the streaming Investor Day is behind us. Bob, can you put this acquisition into context? When you look at the deals you've done in the past, you've talked a lot about acquiring powerful brands like Pixar, Lucas and Marvel, and obviously, we've seen the success there. This feels like a little bit of a different transaction, but I'd love to hear it from you now that you own the business, what you think the biggest opportunity is running this company and integrating it into Disney or opportunities as you look forward, so we can think about where opportunities and upside might exist. And sort of a similar question, Christine, to you, on both synergies and the balance sheet, which are 2 areas you've talked about. Now that you own the business, can you update us on your thoughts on synergy timing and any opportunities you see on the debt side, too?",
            [
                  "This is the first earnings call since our 21st Century Fox acquisition closed, and I'd like to give you a quick summary of our integration and consolidation efforts across the company. From the beginning, we analyzed this acquisition through the lens of our new strategy. When we first considered the deal, we had just announced our DTC initiative, and we saw tremendous value in the Fox assets in terms of expanding our ambitions and enhancing our potential for success. And as you saw on Investor Day, we're already moving forward in that regard. In addition to Fox's tremendous wealth of content, we now have a deep bench of experienced industry leaders across the entire company, a veritable, all-star team of proven management talent who embraced the Walt Disney company strategy and are working in concert to execute it."
            ]
      ],
      [
            "I guess a couple. First on the KPIs for DTC going forward, just wanted to understand what kind of metrics we should be tracking in order to figure out the progress. I mean, Disney+, of course, doesn't launch until later in the year. But would you be helping us with subscribers on the Hulu front or on the ESPN+ front? And the second question is, when we look at film margins of Fox, that's significantly lower than Disney, and I know you don't manage studios from margins. But the delta is just very big, and it could be $1 billion-plus opportunity over time on the margin front. So just wanted to figure out how you're thinking about margins on the studio side for film.",
            [
                  "Thanks, Lowell, and good afternoon, everyone. We're pleased with our results in Q2, which were impacted by our acquisition of 21st Century Fox in late March as well as our ongoing investment in our direct-to-consumer business. But I'd like to start by mentioning the phenomenal success of Avengers: Endgame, which continues to exceed even our highest expectations. After delivering the biggest opening of all time, the movie has generated almost $2.3 billion in worldwide box office to date, making it the second-highest grossing film of all time, after just 2 weeks in theaters. We've also been extremely pleased with the reaction to our Investor Day presentation, which offered an in-depth look at our DTC plans, including additional information regarding ESPN+ and Hulu as well as a detailed look at the content interface and pricing for Disney+. And I'm happy to announce that Avengers: Endgame will be available on Disney+ on December 11, just a month after we launched the service."
            ]
      ],
      [
            "So one for Bob, one for Christine. Bob, for Hulu, does the expansion of your non-Disney+ entertainment content require you to own 100% of Hulu if you want to take that internationally? And so if I ask that right, do you need to own all of Hulu to do Hulu international? And pushing that further, because I imagine you're going to say you don't need to. Disney+ has numerous advantages. You laid those out of the Analyst Day. How do you think about the Hulu opportunity overseas and how that service would be differentiated? And any timing on that? I imagine it will be a couple years before enough content is available. And for Christine, Bob talked about the Fox Film slate coming down to 5 or so films a year ex Fox Searchlight. Fewer films will reduce cost a lot in the Fox Studios side. Does the $2 billion of cost synergies include that sort of bringing down the number of films at Fox? Or should we think about those more as sort of core SG&A and other OpEx-type items?",
            [
                  "Thanks, Lowell, and good afternoon, everyone. We're pleased with our results in Q2, which were impacted by our acquisition of 21st Century Fox in late March as well as our ongoing investment in our direct-to-consumer business. But I'd like to start by mentioning the phenomenal success of Avengers: Endgame, which continues to exceed even our highest expectations. After delivering the biggest opening of all time, the movie has generated almost $2.3 billion in worldwide box office to date, making it the second-highest grossing film of all time, after just 2 weeks in theaters. We've also been extremely pleased with the reaction to our Investor Day presentation, which offered an in-depth look at our DTC plans, including additional information regarding ESPN+ and Hulu as well as a detailed look at the content interface and pricing for Disney+. And I'm happy to announce that Avengers: Endgame will be available on Disney+ on December 11, just a month after we launched the service."
            ]
      ],
      [],
      [],
      [
            "Thanks for taking my questions and good afternoon. So just to keep the ball rolling on the BAMTech meeting, Bob, just curious what came out of that meeting in terms of specific sports content that would be included in it. I mean, you previously mentioned you had a lot of digital rights already. Do you still think it's not necessary to go out and acquire incremental digital rights for it? And then just kind of following on to Ben's question, once it launches, do you think it would make sense for you to go and partner with a big Internet platform in order to help distribute that product? And if I may, one for Christine, please, just, Christine, on the quarter, what was the underlying affiliate fee growth rate for the Cable Networks segment? And then also, you mentioned the timing shifts of the College Football games in the quarter for the Cable net segment, what was the underlying ad growth or decline if you normalize out those timing shifts in the quarter? Thank you.",
            [
                  "At Media Networks, operating income was down 4% in the quarter as growth in Broadcasting was more than offset by decline in Cable. Lower Cable results were driven by a decline at ESPN where higher affiliate revenue was more than offset by an increase in programming and production expenses and a decrease in advertising revenue. Growth in ESPN's programming costs was due to our new NBA agreement and contractual rate increases for NFL programming, partially offset by lower programming costs for College Football due to the timing of the College Football Playoff relative to our fiscal calendar. As you know, this year, ESPN aired only three of the New Year's Six bowl games during the first quarter, whereas it aired all Six games during the first quarter last year. ESPN's ad revenue was down 7% in the quarter. The majority of the decline was due to the shift of the three bowl games out of Q1. So far this quarter, ESPN's ad sales are pacing up compared to last year."
            ]
      ],
      [
            "I guess just from a high level I just wanted to kind of go back to the 5% to 7% EBITDA growth target you guys outlined at the Analyst Day last year. Obviously 2020 guidance came out toward the low end of that and I assume maybe part of that is maybe the tough comp on the California wildfire high-margin revenues but just hoping to get some comments on how you're thinking about that longer-term target and just kind of why we're at the lower end in 2020.",
            [
                  "When you look at our annual financial results from 2017 to 2019 and now through our guidance for 2020 you'll see revenue growth in the 3% to 4% range EBITDA growth in the 4% to 5.25% range and cash from operations less CapEx in the 5% to 12% range all within the bands that we've communicated over the past three years. The amazing part about our results is that we have had some challenges in parts of our business like recycling and renewable energy sales yet the core business continues to churn out earnings and cash at a strong pace."
            ]
      ],
      [],
      [
            "Okay, got it, thanks. And then -- and the next one for me is just on the 60 basis points of margin expansion in the collection and disposal business. From a year-over-year perspective, there is quite a few moving parts in terms of some of the bonus payments made last year, some seasonality nuances and then this year, some technology investments being made. If there is any kind of additional parsing out you could do -- you could provide us in terms of how much of that was newly gained operating efficiency versus some of these other nuances, I just highlighted. Any color around that 60 basis points would be helpful.",
            [
                  "We redesigned the site with input from our customers, and so far it's been really well received. In the first month, we had 20% increase in customers shopping on the website and an 11% increase in overall online sales revenue. e-commerce is a small but growing channel for us, and we're in the early innings of maximizing its value. Another benefit we get from e-commerce is improving customer loyalty, because most online customers enroll in convenient billing and payment options. Finally, on the asset network front, we're seeing great results from our increased focus on enhancing our post collection business model. Our team is securing expansion air space capacity in key markets partnering with communities to ensure that they understand the role that landfills can play at achieving their waste management goals and optimizing our pricing methods to improve profitability and return. In the second quarter, core price in the landfill line of business was 4% and MSW yield was 3.6%, which exceeded 3% for the second consecutive quarter. This is the highest MSW yield in a decade. It's important for us to drive discipline in landfill pricing to ensure that we earn appropriate returns on this capital intensive part of our business."
            ]
      ],
      [
            "Okay. Fair enough. And if I follow-through then on the CapEx, is this an 2018 – I'm running at a higher rate of normalized pace and therefore, I can think of your free cash flow as actually having – there's another (46:41) $100 million of play there to the upside, that's the way to think of – because the other way to put it -look at this is and I would pursue it further with Devina, is if you finished the year at $1.77 billion, but you're going to a midpoint of $2 billion, and I got something in the $200 million as tax related, then it doesn't look like there's a lot of operating growth there when in reality there is.",
            [
                  "We expect that this strong operating EBITDA growth will in turn drive free cash flow of between $1.95 billion and $2.05 billion, that's an increase of about 10% to 15% compared with 2017. We expect our capital expenditures to increase by $100 million to $200 million in 2018, as we make incremental investments to support business growth and invest in our fleet. This will put us temporarily above our long-term stated range for capital expenditures of 9% to 10% of revenue. But as we demonstrated in 2017, we are making this incremental investment in a disciplined way to provide accretive returns and drive long-term EBITDA and cash flow growth."
            ]
      ],
      [],
      [],
      [
            "Okay. That's helpful. And then just maybe shifting gears to recycling, if I heard correctly I think you said is you're expecting about a $0.04 decline year-over-year in recycling earnings in 2018, kind of heavily weighted to the first half of the year. I'm assuming that kind of implies a recovery there in recycle commodities prices, and is that based more on your thoughts that China is going to return to the market and things will begin to normalize or is that more based on maybe your ability to find some alternative dispositions for your recycle commodities material?",
            [
                  "For the fourth quarter, the month of October has seen a significant drop in pricing and we now expect a negative $0.03 impact in the quarter from our recycling operations on a year-over-year basis. However, we do not expect the low pricing in October to become a new normal and while we typically would not give 2018 guidance at this time, based upon current market conditions, we expect to see a $0.04 decline in recycling earnings in 2018 when compared to 2017, heavily weighted to the first half of the year."
            ]
      ],
      [],
      [
            "Hey, a couple of questions. So first one is, and they're interrelated and the first one is the contribution from the Andrew that's sort of embedded into your M&A for revenue contribution in 2020. And then, just sort of looking at the guidance you've given for the share buyback, roughly $800 million for the full year, $200 million in the first quarter, that by our math, it really to take you about 2 times levered by the end of the year sort of $400 million to $500 million out there. And going back to the first comment on the M&A, is that $400 million to $500 million slug money on the table for potential deal activity to sort of get to the 2.5 times or is it 2.5 times somewhere in the future? Just sort of general thoughts on sort of what's involved in the math?",
            [
                  "Looking ahead, we remain committed to deploying capital in the context of our three priorities and will continue working towards a capital structure of approximately 2.5 times net debt to EBITDA. As a result, our full year guidance reflects about $800 million of share repurchases with approximately $200 million of shares during the first quarter. Over the course of the year we will evaluate our share repurchase program and provide updates as appropriate."
            ]
      ],
      [
            "Okay, that's helpful. And in terms of 2020 growth, you're targeting 2% total revenue growth. I think you talked about new products given about a point. You noted that LC is expected to be stable and TA is expected to return to growth. I think just by process of elimination, this leads us to conclude that you're expecting another year of moderating growth for Waters recurring revenue. I just want to make sure we're not missing something up here, and I guess, cutting to the chase, do you expect Waters Division recurring revenue to get up into the 4% to 5% range or right now are you embedding an assumption that it's going to be a little bit lower than that?",
            [
                  "As we look forward to the year ahead, I'd like to provide some broader context on our full year 2020 guidance. To summarize several points that Chris mentioned earlier, we expect increasing benefits from our recent new product introductions, TA instruments returning to growth, stable conditions in the LC pharma market, and stability in China, but note that potential impacts from the Coronavirus outbreak have not been factored into our guidance. These dynamics support full year 2020 guidance for constant currency sales growth of 1% to 3%."
            ]
      ],
      [],
      [],
      [
            "Okay. Thank you very much. And Sherry, just a quick one, just to make sure I’m doing the math right. Based on your new guidance of a net debt to EBITDA target of 2.5x, I think that translates into having $4 billion to $4.5 billion of capital to deploy. Am I doing the math right and did you say that you expect this net debt to EBITDA target to be achieved during 2019? Thank you.",
            [
                  "Towards that end, we plan to continue the acceleration of share repurchases during the fourth quarter and anticipate buying back approximately $500 million of our common stock. This would bring our full-year 2018 share repurchases to about $1.3 billion. As we look forward to 2019, we plan to utilize our balance sheet to support a near-term capital structure of approximately 2.5x net debt to EBITDA ratio with a robust share repurchase program for 2019."
            ]
      ],
      [],
      [],
      [
            "Thanks. Chris, I just want to push a little bit on the tax reform, because this is such a massive change to potentially to your capital structure and investment paradigm. Two specific questions and maybe you can answer about your long-term targets. Number one, do you want to continue to be in a net cash position or do you at some point in the future anticipate being in a net debt position. Obviously, your balance sheet should be able to sustain our net debt position given your cash flow. Second question is in the long run do you anticipate your R&D expenditures or your CapEx to be materially higher as a percentage of revenue than they are now given the ability to invest differently in the U.S.? Thanks.",
            [
                  "Lastly, I would like to make some comments on tax reform generally and the impact on Waters specifically. Overall, I am very positive about what tax reform means for U.S. economic conditions and the overall competitiveness of the U.S. economy. In particular, I am intrigued about the positive implications for increasing U.S. capital deployment by companies of all kinds. Sherry will provide details on the short-term effects of the new law on our tax rate. But before she does, I would like to share my thoughts on capital allocation and the new opportunities created for Waters under the new tax loss."
            ]
      ],
      [
            "Okay, good morning and thank you for taking the questions. I just wanted to talk briefly about SG&A expense in the quarter, it grew 12% actually a little bit more in the fourth quarter, when we look at why the incremental margin wasn’t a bit higher and a strong top line growth quarter, this is the line that jumps out at us, so I am just wondering was there some opportunistic investment in a period of growth and if so where were these targeted investments made and what are you looking for in terms of targeted returns either in 2018 or beyond?",
            [
                  "I am very pleased with our fourth quarter and 2017 in total. We finished 2017 with a strong quarter of sales growth in our key end markets highlighted by broad-based strength from pharmaceutical customers, a rebounding U.S. market and balanced product mix. For the full year 2017, the highlight to me was the great revenue balance across end markets, geographies and product lines resulting in consistent sales performance and double-digit earnings per share growth in each quarter of the year. Total revenue in the fourth quarter was up 6% against a very strong comparison of 9% growth in the same period in 2016. Earnings per share grew 14% in the fourth quarter. This strong finish in Q4 led to full year revenue growth of 6%, a strong P&L featuring modest operating leverage while investing in promising growth initiatives and 13% earnings per share growth for the full year. Additionally, we delivered very strong free cash flow growth of 10% in 2017."
            ]
      ],
      [],
      [
            "So, as you point out the industrial has been a good story all year long as just to reiterate our industrial growth year-to-date has been 7% and actually last 12 months has been 9% because as you allude to we did have a strong fourth quarter in industrial last year. I would say that the balance in our industrial performance is really good between TA and those Waters categories. And TA has really come on strong this year, TA has had a year as you’ve seen that’s developed well over the course of the year and this quarter we saw double digit instrument growth out of TA and naturally a reflection of this we believe is really a winning product strategy around the discovery line of thermal analyzers which as you know has been rolling out steadily since mid-2016 and we’re still in the process of maturing that overall portfolio of tiered instruments for all the different thermal applications.",
            [
                  "Turning to our TA product lines, sales grew by 9% in the quarter bringing our year-to-date growth to 7%. Instrument sales for TA grew 12% in the quarter and continue to be led by our new discovery line of thermal analyzers introduced in 2016. This strong quarterly result also benefitted from the growth of rheology and high temperature thermal systems. We are well positioned to capitalize on market trends of rising innovation in highly engineered, high performance materials."
            ]
      ],
      [],
      [
            "Okay. Thanks. My second question is on the capital plan, up from $14.1 billion to $15 billion, and the energy infrastructure component is also up. But it's up a little bit more on a percentage basis than the overall increase. I think your infrastructure spend as a percentage of the $14 billion was around 10%. Your infrastructure spend as a portion of the $15 billion is closer to 12%. Not a big increase but where are you seeing those opportunities? And do you still think that the risk profile at that level of capital spending is commensurate with what you're doing in the core utilities?",
            [
                  "At this time, we expect to be a partial taxpayer in 2020. Our projection show that we should be able to continue to efficiently utilize our tax position with our updated capital plan. Looking now at the cash flow statement on Page 6 of the earnings packet. Net cash provided by operating activities decreased to $167.5 million. The decrease was largely driven by higher working capital balances. Total capital expenditures and asset acquisitions were $1.8 billion for the first 9 months of 2019, a $68.6 million increase from the same period in 2018. This reflects our continued investment focus on our regulated utility and energy infrastructure businesses."
            ]
      ],
      [],
      [],
      [],
      [],
      [
            "Good morning. I actually wanted to go back to the buy versus build question. If you look at your SHO development, you’re up over $500 million and you’re building a significant number of relationships on exclusivity on the development side that you announced this quarter. Should I read that just generally, and knowing that somebody approached you for the Benchmark portfolio, but knowing all that, is it better to build versus buy? Are you seeing advantages to build versus buy in seniors housing to improve your portfolio?",
            [
                  "As you’ve just heard from my colleagues, Q2 has been another successful and very active capital allocation quarter for Welltower. During the quarter, we completed $2.6 billion of gross investments, including $2.4 billion of high quality acquisitions across eight separate transactions at a blended yield of 5.4%, making Q2 one of our busiest ever for investment. We also announced that in July, we sold our Benchmark senior living portfolio for a gross value of $1.8 billion, booking a capital gain in excess of $450 million. Tim McHugh will be detailing our updated views on acquisitions and dispositions for the full year in a few moments, along with revisions to our full year guidance."
            ]
      ],
      [],
      [
            "Yes, sir. Obviously, QCP, and partnering with ProMedica was a pretty unique transaction. And you're very optimistic there, and I share your view. I noticed in the investor deck, and from this morning, this new slide about the increasing involvement of health care systems in postacute. I guess, my question is, have you had more systems call you looking to partner on postacute deals after seeing this one of ProMedica? And what would be your appetite or target exposure to health care systems within the postacute space?",
            [
                  "Thanks, Tim. Good morning. Earlier this year, I told you that Welltower was back in business. I hope you agree that last evening's announcement of the closing of our innovative ProMedica joint venture, our solid Q2 results and the increase in 2018 FFO guidance all validate that statement. It's no secret that the operating environment for senior's housing remains challenging. Nevertheless, the benefit of owning a premier major urban market-focused portfolio is that we still managed to deliver some growth over last year. Mercedes will give you some perspective on the current state of the senior housing industry and some insights into why Welltower's operating platform continues to outperform. Welltower is well known for owning the best quality health care real estate in the REIT sector."
            ]
      ],
      [
            "John, shouldn't you have a little bit more benefit, I think, in that $0.20? You had the 4.5% sort of long-term debt cost. And clearly, you're financing at least, additionally short-term, then you're going to go out. So that would have been a positive offset to warehousing some of these dilutive assets that you're bringing oat the balance sheet. It just seems like a pretty wide spread, that number should be closer to, call it, maybe $4.10 for the balance -- for the year versus the $4.025 midpoint. And maybe you can just be a little bit more specific in terms of the building blocks or each of the pieces of what's going on. And then wrapped around in that, I mean, as guys moved your earnings a week earlier, I don't know if that is indicative of being -- going out and being arguably in the market, either debt or equity -- and/or equity. So maybe just can you talk a little bit about bringing the earnings forward a week?",
            [
                  "We could not be more excited to announce the closing of our joint venture with ProMedica to acquire the operating business and real estate of HCR ManorCare and Arden Court. The structure of this transaction significantly improves the credit quality of our income stream and demonstrates how a health care REIT and a super-regional health system can work together to reimagine the settings where health care services will be delivered. You will be hearing much more about this in the coming months. As John Goodey will discuss, the accretive nature of this transaction allows Welltower to increase our 2018 normalized FFO guidance from $3.95 to $4.05, up to $3.99 to $4.06 per diluted share."
            ]
      ],
      [],
      [
            "Yes, no that's consistent I think with the messaging you've relayed over time. So my follow-up is really on Genesis again, I don't know if this is for John, but specifically as it relates to guidance. What is the total loan forgiveness that you either recognized in 4Q and that you expect to recognize in '18 of the $400 million plus or so that you've got to Genesis, you had to Genesis? And then what's the embedded total interest income that's in the $4 FFO guide?",
            [
                  "So, so far we have sold $1.9 billion of Genesis loans and real estate with a realized IRR of 10.3% and with today's restructuring Genesis is now 5.2% of in place NOI with a pro forma trailing 1.34 times of EBITDAR and 1.7 times EBITDARM coverage at the profit levels, with the corporate guarantees that is significantly stronger. As with any asset in our portfolio we retain the complete optionality with this high quality PowerBack heavy portfolio in the future. Since the $400 million Genesis purchase option expires in March of last year, we have been communicating multiple possible path of action while negotiating with the public tenant that has been in clear need of a recap for last two years."
            ]
      ],
      [],
      [],
      [
            "Hi, thanks. Congratulations on a really strong year. Appreciate you for taking my questions, and one of those is follow-up to Paul. Come at this CapEx spending a little bit different. You’ve talked really from the time Bernard joined, the CapEx budget has come down pretty dramatically, hit maybe a lower point than we expected in 2018, up a little bit in 2019. I think your 7% target means it goes up another $15 million or $17 million in 2020. Can you talk maybe about the additional context of what is – not only where that – those dollars are going, as you just answered, but what’s driving the reincrease of those dollars?",
            [
                  "Now, let’s look at our balance sheet and review how we’ve done in terms of generating more cash for the business. On Slide 12, we have listed some key cash flow metrics. Operating cash flow of $367.2 million for the full year 2019, an increase of $78.6 million compared to the full year 2018 and a 27% increase. Our 2019 capital spending was $126.4 million, $21.7 million higher than a year ago but in line with guidance."
            ]
      ],
      [
            "And then more broadly, you've noted this on a more positive tone around the demand environment. Can you address a little bit more specifically, what specific areas you're seeing signs of demand for EU. And just a follow up quick one on Huawei as well. You said there might have been about 100 million of lost sales here for the stoppage of shipments for a month, but as you resume shipments, it sounded like you're not doing that at your flow rate. So at what rate are you expecting to be shipping in the September quarter, relative to maybe the anticipated reduction that you’re foreseeing here?",
            [
                  "I would now like to make a comment on Huawei. As Steve described previously, we stopped shipments to Huawei for about a month, having subsequently resumed shipments. As a result of the stoppage, we estimate there was approximately $100 million revenue impact in the June quarter. In addition, given the ongoing uncertainties, our near term opportunities at Huawei have been reduced."
            ]
      ],
      [
            "Got it. Okay. And I appreciate that good traction in the 14 terabyte. On enterprise NVMe commencing revenue ramp this quarter, good to see the initial design win traction, when will the higher margin profile of these products start to show up as a mix related gross margin impact, is it December quarter you think? Is it more first half of next calendar year?",
            [
                  "In addition, we're on track to introduce our first energy assisted recording 16 terabyte CMR and 18 terabyte SMR hard drives later this calendar year. In enterprise SSDs, I'm pleased that our internally developed NVMe platform is commencing revenue ramp at hyperscale and OEM customers in the current quarter. Next week at the Flash Memory Summit, we will be announcing additional enterprise NVMe products, implemented with BiCS4. We expect a significant acceleration of our enterprise NVMe product revenues over the course of fiscal 2020 and beyond."
            ]
      ],
      [
            "Thanks for letting me ask the question. Two if I may. First, Steve or Mike, you've made great progress on transitioning to 96 layer 3 NAND. And you indicated in your prepared remarks that client SSD capacity rose 50% year-over-year. I guess I'd like to ask how you think philosophically about your consumer hard disk drive businesses relative to your client SSD businesses, now that NAND prices have effectively been cut in half on a year-over-year basis and NAND demand electricity, as you called out is making SSDs much more economical today.",
            [
                  "Within Client Devices, surveillance continues to be a long term driver for client HDDs. We are leading the transition in this area to drive managed SMR. In the September quarter, we expect to see a strong revenue ramp of our drive managed SMR products, allowing us to meaningfully participate with compelling surveillance portfolio. For client SSDs, shipments of our NVMe based products grew significantly, representing nearly 50% of our client SSD revenue. As price points have declined, we are seeing customers migrating to higher capacity points and the average capacity per unit of our client SSDs increased 50% on a year-over-year basis."
            ]
      ],
      [],
      [
            "Hey, good afternoon, guys. I just wanted to start with a top line question. Obviously, a good start to the year here, the 5% constant currency revenue growth here in Q1. I know you're leaving the guidance for the year unchanged at the low to mid levels, is that just because you've got a tougher comparison in Q4, I believe it is, or are you just being a little bit cautious at this early juncture of the fiscal year in terms of some of the soft spots in the market that you alluded to in your prepared remarks?",
            [
                  "Thank you, Mike, and good afternoon, everyone. We are very pleased that we continued the momentum from the end of last year into the first quarter of 2018. We delivered healthy 7% revenue growth, or 5% in constant currency for both the overall company and our consumer money transfer business, and we also generated solid profitability. Our digital business continued its impressive run with 23% revenue growth for westernunion.com money transfer in the quarter or 20% in constant currency. And westernunion.com is becoming an increasingly important part of our business, representing 11% of total money transfer revenues in the quarter, up from 6% just three years ago."
            ]
      ],
      [
            "Thank you, and good afternoon. Just on – strategic question on pricing, I think, Hikmet, last quarter you suggested that The Western Union's pricing broadly is about 15% above the competition. I mean, I think that's come down somewhat over the years. But it does still seem like there are other players in the industry that are growing at a much faster pace. Do you think that your price premium at this point is at the right level or does it need to continue to narrow over time?",
            [
                  "Thank you, Mike, and good afternoon, everyone. We are very pleased that we continued the momentum from the end of last year into the first quarter of 2018. We delivered healthy 7% revenue growth, or 5% in constant currency for both the overall company and our consumer money transfer business, and we also generated solid profitability. Our digital business continued its impressive run with 23% revenue growth for westernunion.com money transfer in the quarter or 20% in constant currency. And westernunion.com is becoming an increasingly important part of our business, representing 11% of total money transfer revenues in the quarter, up from 6% just three years ago."
            ]
      ],
      [],
      [
            "And just one other quick one, if I could. Previously you talked about the strategic investments generating about $50 million of EBITDA, the year just ended and additional $65 million in fiscal '20 and then additional $70 million in '21, and additional $90 million in '22. Are those still the types of numbers that are embedded in the guidance you provided for '20? And you did also mention that there would be some costs related, for instance the Florence, et cetera. Could you give us a sense as to transitional costs would be in '20 offsetting some of the benefits that we get from the projects?",
            [
                  "As we have shared previously, we will invest $1.1 billion in capital expenditures to maintain and improve our mill and converting systems, including $275 million for our strategic projects in Florence and Três Barras. As we complete these projects, we anticipate that we will return to 900 million to $1 billion annual capital investment level in fiscal year 2021. In the appendix, we have provided additional details that should help you complete your models."
            ]
      ],
      [],
      [],
      [
            "Yes. Good morning. And thanks for all the details. If I look at your CapEx guidance just a quick question on this for the fiscal year that starts in three months – I'm sorry a year from three months from now the fiscal 2021 and I assume your DD&A saves at $1.53 billion that would suggest you would generate $2.25 billion of free cash flow, if you earn zero which is 6% of your stock price which means your free cash flow yield at zero earnings would be higher than almost all the rigid flexible packaging stocks. Could you just make sure my math is right? And also could you – do you have a thought as to whether that $900 million to $1 billion is sort of a sustainable level of CapEx that reflects modest growth projects in addition to maintenance?",
            [
                  "The WestRock team is performing extremely well as we proactively respond to a changing industry landscape, characterized by the challenges of additional new paper capacity, combined with softer demand in some markets. We see increasing opportunities for sustainable packaging, e-commerce packaging and value-added packaging solutions. We generated $749 million in adjusted operating cash flow during the quarter and we deployed $351 million of this cash flow in capital investments. This included $181 million invested in our strategic capital projects. We paid $117 million in dividends and we reduced our net debt by $282 million. Our net leverage at the end of the quarter was 2.95 times. Our pension plans remain fully funded."
            ]
      ],
      [
            "With regards to the inventory reduction effort, you talked about, I think the 100,000 tons of excess inventories and taking down 35,000 tons in January in slowbacks. So, just to be clear, will you lower another 65,000 tons in the course of the quarter or could that carry through to next quarter? Just trying to understand the timing.",
            [
                  "So in this quarter, the current quarter we’re reducing our inventories to normal levels, we’re matching our production to our customers demand. In January, we initiated our inventory reduction with 35,000 tons of production slowbacks. The impact of this is incorporated into our guidance that Ward will discuss in a few minutes."
            ]
      ],
      [
            "Thank you for all the detail there, Devin. Just switching gears to kind of OpEx 2.0, can you maybe just elaborate a little bit on where you are targeting the $50 million to $70 million just across the four different buckets you outlined? Specifically, how much would maybe fall into that margin bucket and that efficiency bucket?",
            [
                  "Together, these four categories expand the breadth of OpEx to include every business and function across our company. I'm really excited about the opportunities that OpEx 2.0 creates and the potential it has to further drive our working together culture. In 2020, we’re targeting $50 million to $70 million of additional OpEx improvements from these areas and I look forward to sharing more about our key initiatives as the year progresses."
            ]
      ],
      [],
      [],
      [],
      [
            "Good morning. Thanks for taking my questions. I wanted to start out just a couple of questions around North American volumes and maybe a follow-up about your last comment on, Jim around units, but just in the quarter, with volumes a bit weak it seems like on the major appliance side a little below what [indiscernible] said, and then I think we all were expecting some rebound in small appliance shipments, just given the timing shifts you had indicated last quarter. Can you talk us through just the inventory dynamics potentially your trade partners both in major appliances and small appliances? And how we should be thinking about what happened in the quarter and maybe how that's progressing into 2020?",
            [
                  "Turning to Slide 5, I will show the drivers of fourth quarter and full-year margin expansion. In the fourth quarter, price mix delivered 100 basis point of margin expansion as we realized the benefit of pricing actions and mix benefit from our product launches. Additionally, we delivered positive net cost takeout in the quarter. However, improving trends in raw materials more than offset continued tariff headwinds in North America, resulting in a favorable impact of 25 basis points. These margin benefits were partially offset by continued marketing and technology investments and the unfavorable impact of currency. Our full year very strong margin expansion from price mix was partially offset by the impact of tariffs, increased brand investments and currency. Overall, we're very pleased to deliver an even slightly over deliver on our margin commitments and are confident this positive momentum will continue to drive strong results in 2020."
            ]
      ],
      [],
      [
            "Right, okay. And then my follow-up question, I guess, with respect to the North American business. I guess there's a lot of questions in the market today. Regarding you've got negative North American units, the working capital certainly was below the guide that you discussed on the October call yet revenues were generally flat and you put up some pretty impressive margins. So I guess within the revenue growth math, can you talk about how strong is the mix and just how confident are you that the mix will remain strong through 2020. And I guess you've got a lot of innovation in the market right now. It's a matter of just -- we had a good year in mix and then we end up against some pretty tough mix comps. Are we in the beginning of maybe a two, three, four-year stretch driven by innovation, a very strong mix contribution to the P&L?",
            [
                  "Turning to Slide 5, I will show the drivers of fourth quarter and full-year margin expansion. In the fourth quarter, price mix delivered 100 basis point of margin expansion as we realized the benefit of pricing actions and mix benefit from our product launches. Additionally, we delivered positive net cost takeout in the quarter. However, improving trends in raw materials more than offset continued tariff headwinds in North America, resulting in a favorable impact of 25 basis points. These margin benefits were partially offset by continued marketing and technology investments and the unfavorable impact of currency. Our full year very strong margin expansion from price mix was partially offset by the impact of tariffs, increased brand investments and currency. Overall, we're very pleased to deliver an even slightly over deliver on our margin commitments and are confident this positive momentum will continue to drive strong results in 2020."
            ]
      ],
      [],
      [],
      [
            "So it's been quite a year, very steady U.S. results as you're gaining price amid lots of international volatility. So just because Europe was such a big adjustment, I would say, this year, and I think it's important what you're doing in your small business appliance, so you're walking away from $230 million of revenue, which is a $60 million loss. Just for perspective, was that business, businesses, were those making money in, let's say FY 2016 and FY 2017? And I ask because I'm trying to understand if you can shrink your way to profitability given your, I believe, FY 2020 margin targets, which are still below your long-term targets of 7% to 8%. I'm just trying to understand how you might be able to get there sooner on the margin basis.",
            [
                  "Second, as we announced last quarter, we have begun to reevaluate certain aspects of our EMEA business. As part of that effort, we are announcing several new strategic actions to refocus and right-size our business. We will be exiting a number of lossmaking businesses, including our Turkish domestic sales operation which does not include the factory operations, as well as our Hotpoint branded small appliance business. Additionally we are evaluating our South Africa operations for a potential sale as we refocus on our core European business. Together, these three businesses represent approximately $230 million in revenue and a sizable EBIT loss of $60 million for the full year of 2018."
            ]
      ],
      [
            "Okay. Well in the U.S. looking at the volume and price, I had thought looking at 2012, when you guys got about 5% price, which is where you're kind of running, volumes in the industry or your volumes actually had fallen 5% that year, realizing there's Canada and Mexico in there. Do you think the elasticity we saw in 2Q where you got price, volume was very weak, now you outpace the market with 5% price. Is there elasticity after a certain period of price introduction, which is to say you're gaining share, is that because the price increase has abated and/or we receive lots of questions from clients about the Koreans, LG, Samsung perhaps having run out of pre-tariff product. Could you just talk about price and volume dynamics related to those two items, elasticity and the Korean tariffs? Thank you.",
            [
                  "Thanks, Marc. And good morning, everyone. Turning to slide 8, we review the third quarter results for our North America region. We delivered very impressive results in the quarter with both revenue growth and ongoing margin expansion, in spite of a challenging external environment. Net sales increased 5% despite an industry demand decline of nearly 2% in the quarter. We delivered this growth through strong price/mix as well as volume growth due to market share gains, primarily in the kitchen category. Overall, we expanded our ongoing EBIT margin 20 basis points to 12%, as our strong performance overcame more than 200 basis points of raw material, tariff and freight cost inflation. These strong results once again demonstrate the success of our proactive price/mix and cost initiatives and show the fundamental strength of our business in North America."
            ]
      ],
      [],
      [],
      [
            "Got it. Okay. And the second related question is really, and this ties in taxes as well, but just I want understand better the change in tax rate expectations. And to the extent that the pension funding contributed to the lower tax rate this year, I would assume that it also is having some benefit on your cash earnings. And so I wanted to understand, kind of, you're pointing out the $800 million of, excluding voluntary items, but it seems like tax rate would've been higher if not for the pension funding. So what's the cash impact of that from a tax benefit standpoint, and then on your overall tax rate?",
            [
                  "Turning to slide 18, our total free cash flow guidance for 2018 remains essentially the same as our previous guidance. We have reduced our guidance for cash earnings as a result of our performance in EMEA. Capital expenditures have been slightly reduced due to changes in the timing of certain projects. Excluding the impact of discrete voluntary items, our full year 2018 free cash flow expectation is approximately $800 million. Our updated free cash guidance reflects approximately $350 million of pension pre-funding we discussed earlier, as well as the benefits of a real estate portfolio optimization opportunity expected in the fourth quarter."
            ]
      ],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [
            "My first question is -- you planned to support the 5% to 8% growth at 50 and funded yield at 40 -- is well understood. How does the higher oil price factoring the model? Meaning, do you use excess cash flow to accelerate the timing to reach our model via permitting resources growth? Or do you return cash to shareholders or further bolster the cash bridge to the model? How does that -- if we could talk to those pieces, if you could.",
            [
                  "Turning to Slide 6. As I mentioned in last quarter's call, we will include this slide each quarter to update you on our progress towards our goal of cash flow neutrality at $40 WTI and breakeven at $50 WTI. This means we'll cover the dividend and the production sustaining capital within operating cash flow at $40 WTI, and at $50 WTI we'll be able to generate 5% to 8% production growth."
            ]
      ],
      [
            "I guess the focus again is on Greater Sand Dunes well results. I wonder, Vicki, if you could help us understand what's changed as it relates to the timeline of your 80,000 BOE per day target? The wells are clearly substantially better than what you are expecting when you set that target, but you're still talking about a year end 2018 type of cadence. Are you just being conservative there, or is there reason why you're sticking with that timeline? And I've got a follow-up, please.",
            [
                  "Thank you, Cedric, and good morning, everyone. And thank you, Vicki for your restraint during your opening highlights on our well results in the Permian. Thanks to our team's efforts, we had some basin-leading well results to share with you. Across our domestic business, we're delivering more production with less cost to generate growth and value towards our breakeven plan. As Vicki mentioned, we attribute this success to our differentiated value-based development approach. Our Permian Resources New Mexico team delivered record-breaking well results across multiple benches in the Greater Sand Dunes area as shown on Slide 14. During the quarter, our team put on a total of 7 wells in the Greater Sand Dunes area with 30-day production rates that averaged approximately 3,750 BOE per day. 3 of these wells ranked in the top 15 all-time best wells in the Permian basin based on 30-day BOE per day."
            ]
      ],
      [],
      [],
      [],
      [
            "And then my follow-up is on the U.S., the 4Q production growth in Permian Resources trajectory into 2018 is obviously impressive. So with the meaningful increase in the number of resource flows as you're bringing online especially in New Mexico, given some of the tightness of the labor market we're hearing about, logistical issues, tightness with services we've seen from others. Can you -- just discuss the confidence and the timing of your planned ramp that you've laid out and how your mitigating some of those risks regarding the timing of the delivery there, given what we've heard from some other operators? And then may be specific comment on 4Q. The guidance range is wide there. Can you just maybe want to talk about what went to get to the lower end or the higher end of that guidance. What the sensitivities are there?",
            [
                  "I will now share some third quarter highlights on Slide 5, and then I'll provide an update on our progress towards our cash flow breakeven plan. Let's start with our most recent well result. While I don't want to steal this thunder from Jody, we've had some real exciting results in Southeast New Mexico. We attribute these new basin-leading well results through our value-based development approach. We're confident in our ability to sustain these results as well as in our ability to reach and surpass our breakeven growth targets of 80,000 BOE per day in Permian Resources."
            ]
      ],
      [],
      [
            "On the strategic plan, your strategic plan now evolves this lower stress case at 40. And given the capital efficiencies can you discuss the $50 side and is the 5% to 8% growth is that the sweet spot for growth or where improvements would rather lower to $50 threshold or could that allow the growth to drive higher. Just trying to understand how you see the upper end evolving with improving productivity or commodity price?",
            [
                  "Turning to slide five, we have clarified what it means for Oxy to be breakeven at lower oil prices. Upon completion of our plan, we will be cash flow neutral at $40 WTI, meaning we’ll cover the dividend and the production sustaining capital within operating cash flow. At $50 WTI, we’ll also be able to generate 5% to 8% production growth. This chart walks you through the milestones we need to achieve this plan. Our entire organization is laser focused on our breakeven plan, in fact we introduced this plan as the key metric for our compensation across the organization. All the decisions that management will make in the upcoming quarters will align with achieving these goals."
            ]
      ],
      [
            "Good morning. Vicki, I was just wanted to ask you, I’m looking at the various illustrations of the $40 and $50 per barrel spending and the 30% CAGR and the Permian resources and your remarks about replacing solid cash flows. Is the overall message that you’re going to maintain this spending plan through 2018 regardless of oil prices or is there any chance that you would pull back if prices really swooned. And in particular what I’m trying to understand is that the spending that you’re outlining is really necessary to drive the efficiencies that are going to continue to lower cost further out?",
            [
                  "Turning to slide five, we have clarified what it means for Oxy to be breakeven at lower oil prices. Upon completion of our plan, we will be cash flow neutral at $40 WTI, meaning we’ll cover the dividend and the production sustaining capital within operating cash flow. At $50 WTI, we’ll also be able to generate 5% to 8% production growth. This chart walks you through the milestones we need to achieve this plan. Our entire organization is laser focused on our breakeven plan, in fact we introduced this plan as the key metric for our compensation across the organization. All the decisions that management will make in the upcoming quarters will align with achieving these goals."
            ]
      ],
      [],
      [],
      [],
      [
            "I want to come back to pricing a little bit, and I think a lot of us kind of have questions of trying to relate what's going on in LTL to what's happening in the truckload market. And obviously, there's tightness there, and we're seeing rate increases coming in higher than typical sort of normal rate increases would see. So as we think about that relationship, could you kind of help us a little bit, maybe frame it up with the 3.5% to 4% annual price increases x fuel. Is this the kind of year where you can get sort of the high end of that because of what's going on in the truckload market? Or should we maybe sort or pull the 2 of them apart and think about it more specifically to LTL? Just trying to get some sense around that would be helpful.",
            [
                  "We reported to you about a year ago that we were feeling cautiously optimistic for 2017 based on customer conversations and improving macroeconomic trend. I don't know, however, that any of us anticipated that our revenue would be growing at a 19.5% rate to close out the year. Our revenue growth in the fourth quarter included improvements in both density and yield, which generated operating leverage that allowed us to improve our operating ratio by 90 basis points to 83.9%. LTL tons per day increased to 14.4% for the fourth quarter, which was our first double-digit increase in 11 quarters, and the pricing environment continued to be favorable. LTL revenue per hundredweight increased 5.1% and increased 3.1% when excluding fuel surcharges."
            ]
      ],
      [],
      [
            "Yes, good morning. Thank you very much for taking the question. Look, first one quickly for Phil, could we get the impact of Acuren [ph] on Q3 organic. My second question is do you expect more disposition to be announced next year, John in you introductory remark you said you were still identifying non-strategic underperforming businesses for disposition, but any initial idea on what the impact could be next year on top of the 3% in the first half, are we talking an extra 2, an extra 4? And then the last one is the impact on margin from disposition to the business sold are lower in line or higher margin than the group? Thank you very much.",
            [
                  "Thank you, Shub. Good morning. Thank you for joining our call this morning. I am pleased to speak to you this morning about our third quarter 2018 results. It’s been a very busy quarter as we successfully executed many of the repositioning plans and dispositions that we discussed on our last call on July 17. On August 31, we completed the previously announced disposal of Sellbytel. In addition, during the third quarter, we disposed of 18 other companies, which were primarily in our CRM execution and support discipline and to a lesser extent in our CRM consumer experience discipline. These businesses were no longer aligned with our long-term strategy. The disposition activity resulted in a net gain to our P&L in the quarter which Phil will cover during his remarks."
            ]
      ],
      [],
      [
            "Yes, good morning. Thank you. John, if you look back at 2017 and you think out to 2018, your 2% to 3% organic revenue growth perhaps target for the New Year. Can you just go through maybe the five or six areas that you think is holding back the organic growth and your peers as well? I mean, obviously, the economy seems like it's accelerating here in the U.S also around the world. But what’s holding back your customers from spending more towards the ad service dollars that you get is not growing as much as it might be in the prior cycles? I have a few other questions. Thank you.",
            [
                  "Before I do that, I will review our fourth quarter and 2017 results. I do want to point out that while the 2017 Tax Act resulted in a charge in the fourth quarter, Phil will cover this in his remarks. Moving forward, into 2018, lower U.S tax rates will have a direct positive impact on Omnicom and many of our clients. I’m pleased to report we achieved our internal organic growth and margin targets for the full-year of 2017."
            ]
      ],
      [
            "Thanks. Good morning. Thank you for the additional disclosure on the CRM segments. Maybe, John, could you talk a little bit about how you view those different disciplines in terms of the growth opportunity ahead of you? I know you made some management changes last year. The fourth quarter looked pretty healthy. Do you feel like those buckets -- those two CRM buckets are poised for growth in '18 based on what you’re seeing today? And how do you compare that growth outlook to what you've seen in advertising and media which has been at least until Q4, more robust? And then I had a -- just a quick follow-up. Go ahead",
            [
                  "Thank you, Shub. Good morning. I’m pleased to speak to you this morning about our fourth quarter and full-year 2017 results. 2017 was an eventful year for the marketing and advertising industry. Many of the world's largest marketers and best known brands continue to undergo major changes driven by advances in technology, new disruptive competitors and changing consumer behavior. The breath and rate of change has CEOs and CMOs focused on the ability of their marketing organizations to keep pace and that is presenting opportunities and challenges for our agencies."
            ]
      ],
      [
            "And then on Q4, you say it was the hardest quarter to guide to, because you had $200 million to $250 million of kind of project-based revenue. Could we get a feel of the last kind of 10 years, what has been the worst year and the best year of those project-base? Does it go as low as 100 million and as high as 400, so we can gauge the volatility of Q4? Thank you.",
            [
                  "Looking at the rest of the year, there are couple of factors that result in less visibility as we plan for the fourth quarter, as has been the case over a number of years this quite a bit of project work that occurs in the fourth quarter that can impact revenue. Each year, we've found this year-end project work is between $200 million and $250 million. Client spending on these projects is not easy to forecast, and typically it is based on individual client circumstances and general economic conditions."
            ]
      ],
      [],
      [
            "That was very helpful. Really do appreciate that. Maybe as a follow-up question, kind of a two parter, if you don't mind. With your CapEx activity, I mean, despite the fact that you've announced these new projects, it is definitely lower than where it's been and you sort of see slowing producer activity. I was just wondering what are the opportunities for ONEOK to pivot and optimize on the cost side? Are there costs that you can now strip out now that you can sort of see where your business is running? And also, are you able to potentially pursue an asset-light strategy? When I sort of think about your Elk Creek expansion as well as the West Texas LPG brings a lot more volumes into -- on the NGL side, which would suggest you would need a frac. But given their excess frac capacity out there, are there ways for you to sublease others -- other fracs and sort of take advantage of that in pursuing asset-light strategy? Just sort of wondering if you can sort of talk about other ways to optimize for further earnings growth beyond 2021?",
            [
                  "2019 was an outstanding year, a year of project execution and record-setting safety performance for ONEOK, positioning ourselves for exceptional growth in 2020 and 2021. Yesterday, we announced fourth quarter and full year 2019 results, announced our 2020 guidance and provided a 2021 outlook. We also announced 3 expansion projects that will further strengthen ONEOK's position in the Williston and Permian Basins, and increase the needed natural gas processing and NGL transportation capacity for our customers. It is important to point out that these high-return projects build off of our existing assets. These projects include the Demicks Lake III plant in the Williston Basin, the full expansion of the Elk Creek pipeline to 400,000 barrels per day and the fourth expansion of the West Texas LPG pipeline since October 2017."
            ]
      ],
      [],
      [],
      [
            "Okay great. And then just a follow-up, ethane recovery versus rejection has been a topic for some time. There's kind of an interesting developing market dynamic where you look at natural gas capacity being scarce in the Permian. And at times you've seen some sizeable differentials with Waha and, and Henry Hub, it could create a scenario where the economics of recovering ethane becomes greater in the Permian than any other basin in the country. And there's the possibility that Permian ethane recovery crowds out other basins. How is ONEOK positioned if this materializes? Is it offset by the full scale system that you have in place? Or is there some risk to the $100 million plus of ethane recovery that you're looking for this year.",
            [
                  "In addition four more crackers with a total capacity of nearly 200,000 barrels per day of ethane are expected to be completed later this year. As outlined in our 2018 guidance, this additional demand for ethane is expected to drive approximately $100 million of additional EBITDA in our NGL segment compared with 2017. After staying for a few years now that new petrochemical facilities and ethane crackers are being built, it is now evident in the marketplace that the incremental demand for ethane is here. Our focus remains on executing our cracker growth projects to meet the need of our customers at Williston, Powder River, DJ STACKS SCOOPS and Permian basins."
            ]
      ],
      [],
      [
            "Good morning, everyone. For the initial 50 plus percent of the Arbuckle II pipeline that's contracted, how many new plants are going to be connected to the line to get to the 200,000 barrels per day? Can you give us any more color on how much of it is third party plants versus your plants? How much of it are volumes from Elk Creek filling into line versus volumes you are picking up in Oklahoma or West Texas? Is that's also an option for supply connection?",
            [
                  "This year we have announced two strategic NGL pipeline projects, Elk Creek and Arbuckle II. The 530 mile Arbuckle II pipeline will have an initial capacity of 400,000 barrels per day and has the capability to be expanded up to one million barrels per day with additional pump facilities which could more than double our current capacity between the Mid-Continent and Gulf Coast with minimal capital investment. We are also adding 125,000 barrels per day of additional fractionation capacity at Mont Belvieu with the announcement of our MB-4 fractionator. The Arbuckle II pipeline is already more than 50% contracted and will provide producers in all the basins where we operate with connectivity to growing demand in Mont Belvieu. The adjusted EBITDA are multiple forecasted for these projects are based only from these contracts and discussions with customers regarding additional supply continue to take place."
            ]
      ],
      [
            "Hi, good morning. I guess this is going to touch on the last question a bit, but in terms of the extension with Canadian Valley, you are getting 200 a day for 145 million to 155 million. I am just thinking back to the – before the commodity price collapse of 2015, you had plans for the Knox plant 200 a day again for 365 to 470 million. So, from a cost per capacity standpoint, this is clearly better. My question is why not choose to expand Canadian Valley in the first place over Knox a few years ago? And then is there something that’s changed perhaps in location of where Knox is going to go that makes it less necessary or is there potential to revive that plant. How should we think about all that?",
            [
                  "These expansions are expected to be complete by the end of 2018. Additionally, we announced the construction of a 30 mile natural gas pipeline through the heart of the STACK to connect with an existing third-party natural gas processing plant in Oklahoma, which will provide us access to an additional 200 million cubic feet per day of capacity and is expected to be in service by the end of 2017. And most recently on Monday, we announced plans to expand our Canadian Valley natural gas processing facility in the STACK area of Western Oklahoma. The project will increase capacity at the facility to 400 million cubic feet per day from 200 million cubic feet per day and is expected to be complete by the end of 2018. It also will provide approximately 20,000 barrels per day of additional volume into our NGL gathering system. Combined with the third-party processing agreement I just mentioned, this plant will bring our total Oklahoma processing capacity to 1.1 billion cubic feet per day. The additional capacity is needed to support the rapidly growing production in the area and is backed by more than 200,000 acres of dedication primarily fee-based contracts and minimum volume commitments."
            ]
      ],
      [],
      [],
      [
            "Okay, great. And then just going off the STACK/SCOOP, several weeks prior to the announcement of the expansion on Canadian Valley you guys announced that you would be offloading 200 million cubic feet a day processing from that region to a third-party plants, could you explain why these volumes aren’t being directed to the Canadian Valley plant, is it more of a timing thing, a geographical thing or anb economic decision?",
            [
                  "These expansions are expected to be complete by the end of 2018. Additionally, we announced the construction of a 30 mile natural gas pipeline through the heart of the STACK to connect with an existing third-party natural gas processing plant in Oklahoma, which will provide us access to an additional 200 million cubic feet per day of capacity and is expected to be in service by the end of 2017. And most recently on Monday, we announced plans to expand our Canadian Valley natural gas processing facility in the STACK area of Western Oklahoma. The project will increase capacity at the facility to 400 million cubic feet per day from 200 million cubic feet per day and is expected to be complete by the end of 2018. It also will provide approximately 20,000 barrels per day of additional volume into our NGL gathering system. Combined with the third-party processing agreement I just mentioned, this plant will bring our total Oklahoma processing capacity to 1.1 billion cubic feet per day. The additional capacity is needed to support the rapidly growing production in the area and is backed by more than 200,000 acres of dedication primarily fee-based contracts and minimum volume commitments."
            ]
      ],
      [],
      [],
      [
            "Got it, okay, perfect. And then I guess following-up on the change in the gathered volumes for NGL gathered volumes versus a static forecast on what you were expecting or what you are still expecting on the frac side, just looking at that if I think about $25 million of segment EBITDA decline on 25,000 barrels a day of full year movement on the guidance [Technical Difficulty] by somewhere around $0.065 a gallon, I know when you quote the regional areas some include frac, some don’t and it would seem like that’s more aligned with an area that includes fractionation services that’s if an absent, so I am just wondering were you – was that gathering amount planned to be frac then you were just sort of previously at the high end of where you thought the frac items would be and backgrounds with metal or how do we interpret I guess the financial implications of the volume if you could help us with that would be helpful?",
            [
                  "In our earnings release, we provided updated segment specific guidance and volume expectations. Overall, we have increased adjusted EBITDA for our natural gas gathering and processing and natural gas pipelines segments and increased our G&P volume outlook. These increases were primarily driven by higher than projected volumes in the Williston Basin and STACK and SCOOP areas and our expectation that drilling and completion activity will remain strong through the second half of the year based on recent discussions with our producer customers. We narrowed our adjusted EBITDA guidance in the natural gas liquids segment reflecting adjustments for the timing of the expected volume increases from recently connected third-party plants. In mid-June, we announced NGL and natural gas related expansion projects totaling approximately $170 million to accommodate growth in the STACK area. Projects include a 60,000 barrel per day expansion of our Sterling III NGL pipeline, increasing its capacity to 250,000 barrels per day and additional NGL gathering system expansions in the area, which are all backed by a long-term contract and plant dedications."
            ]
      ],
      [],
      [],
      [
            "Thank you. So your aggregate results have been I guess relatively steady might be the right way to characterize it. And during this period, I think investors really appreciate the share buybacks and the dividend, dividend increase this quarter. I guess I want to sort of follow on with that line of thinking, Mark, and this uptick in fiscal 2020 and you talked a lot about your Cloud Apps and we get a lot of information on that but can you talk a little bit about what extent the data base options might be a driver to some of that revenue acceleration and how big is the Middleware business at this point?",
            [
                  "Looking forward, I do expect FY 2020 revenue growth will be higher than FY 2019. And EPS this year will be certainly grow double digits, as Safra mentioned. I’m going to give you a few customer wins as well. Try to give you a flavor for what happened in the quarter for us. Most of these didn’t affect our revenue. Most of these are all really bookings that occurred in the quarter, but I thought I’d give you some context about some people in our user base as well as outside our user base."
            ]
      ],
      [
            "SaaS ERP is the largest growth driver within SaaS and, we believe within your total apps business, but there's so many moving parts that it is not obvious in the reported results. Can you give us a sense of when you expect that SaaS ERP will be large enough and growing fast enough to start to visibly improve year-over-year revenue growth first in SaaS and then in overall apps? And then as a quick follow-up, can you give us any color on the timing of conversions booked to revenue, has it improved or not? Thank you.",
            [
                  "In terms of SaaS bookings, I want to try and give you some context. Now of course as I talked about booking, this did not show up in any way shape or form in our revenue. ERP and HCM's booking growth rate has accelerated about last four quarters and now was in the high-30s. In addition, we saw our largest movement of the installed base customers to ERP cloud. We're almost roughly 200 customers moving in the quarter, all that of course shows up in bookings and not revenue."
            ]
      ],
      [
            "My question is a follow-up to Brad's and Larry, and I think it's more for Mark or may be Larry too. We understand your focus on moving your 50% relational database market share to the Oracle cloud, but that's going to take time for your customers to get there. And until then, they will likely consider to buy for on-premise deployments. This quarter platform and infrastructure grew 1% constant currency and we realized there is headwinds in there from like the middleware business and probably some other things, but more interested in the database. As you say Larry that that's one of the strategic products as that has to be successful here. Can you give us some more color on the database in this quarter, especially for the options? And to that stand out for me or multi-tenancy and in memory, but I know there is other that are associated with the autonomous database. I mean these are two, but others that are really specifically. And I guess when will we see those tailwinds from whatever middleware and whatever else is causing them to subside in that part of the business?",
            [
                  "Technology analysts also believe that Oracle’s new Autonomous Database gives Oracle the largest technology lead we’ve ever enjoyed over our database competitors since we entered the database market almost four decades ago. As we pair our new Autonomous Database with our new generation two cloud infrastructure, we expect not only to hold on to our 50% database market share, we expect to increase it. That means millions of Oracle database will move to the Oracle Cloud. Those are the two strategic initiatives that we are focused. One, continue to expand our market leadership in cloud ERP, which should make us the world's largest cloud application company. And two, maintain our database technology leadership and migrate our 50% database market share to the Oracle Cloud. We’re optimistic about our ability to deliver on these two strategic initiatives and our ability to be the leader in these two key market segments."
            ]
      ],
      [],
      [],
      [],
      [],
      [],
      [
            "Thank you. These are impressive results. And I will let others focus on those details. Mark, I would like if you could talk a little more about the AT&T deal, AT&T as you pointed out in the press release when that came out has been a customer of Oracle and we all know that, so I guess the question is how incremental is this deal to Oracle, is it a price uplift, because you are providing the entire infrastructure with cloud versus just the software or does it also include work – new workloads. And I guess can you give us any idea about how much incremental business assuming there is some which I think there obviously is, this means for you versus your previous relationship with AT&T?",
            [
                  "Thanks, Ken. Good afternoon, everyone. As you can see, we had a tremendous quarter in just about every way as cloud revenue, new software license and earnings were all much better than expected. The adoption by our customers of our products and services is at an all-time high. But before going into more detail about Q4, you can also see that we have made significant improvement in our financial reporting to align with how we are running the business now. The cloud has become our predominant growth vehicle. As you can see in our press release supplemental pages, we have given you tons of detail. We have given you the detail in our new presentation format and we have also provided the reporting in our old format going back through fiscal 2016 and 2017. So, you can see the numbers the new way, the old way all including history to help your transition this quarter."
            ]
      ],
      [
            "Great. Thank you very much. This question could be for Mark or Safra, I mean obviously the cloud bookings number was very strong and I was wondering if you could just share with us any color on the impact that NetSuite might have had on the growth rate for cloud bookings and also well, I know you are not guiding to fiscal ‘18 cloud or SaaS, PaaS growth, I am just wondering if can share with us, Mark, you commented about having – doing better and expectation to do better than $2 billion in new cloud ARR, I am just wondering if you could talk a little bit about your confidence level there. And then just for the sake of clarity, since we do get this question from time-to-time, this $2 billion plus number that you mentioned is all new cloud business and does not include renewals, if you could just clarify that for people? Thank you.",
            [
                  "Thanks Larry. First, I would like to congratulate Safra for getting through all that material that was a thing to get through. Listen, thanks Larry. Good quarter for us, obviously we tracked ahead of virtually every metric that I track, whether it’s cloud bookings, cloud revenue, EPS, really everything on my KPI list was at a record level. Turning to cloud bookings, $855 million, it’s the best quarter we have ever had, it’s up 43% over what was a very strong Q4 last year. We had a goal of $2 billion in ARR. We finished with nearly $2.1 billion. Next year we will sell more. By the way booking revenue growth rates are given in CD unless otherwise said, SaaS bookings were $486 million, PaaS and infrastructure bookings $369 million. As Safra said cloud revenue growth at 66%, we are now at $6 billion annualized run rate. For total software and cloud, to Safra’s point 80%, roughly 80% of our trailing 12 months revenue is now recurring in nature. SaaS revenue while up 76% was an acceleration from 40% growth last year. ERP was up 156% organically, that did not include NetSuite."
            ]
      ],
      [
            "Hi, thanks and congrats on really a fabulous fiscal Q4 and thank you for the increased disclosure in terms of on-premise breakdown of outsource platform. When I look at your Q4 results in the context of the full year, it’s basically almost impossible to argue that Oracle is not at the reaccelerating revenue growth inflection point in its transition to cloud, Mark would talk about apps, obviously has been growing mid to high single-digits, which is acceleration from last year, you talked about accelerating the 10% this coming fiscal year, so my question to both you or Safra is when you think about the platform side of the business here at Oracle, that’s been growing at low single-digits, where does that business fit in terms of the lifecycle transition to the cloud in terms of just the trajectory of net revenue growth? And I just have one follow-up to that.",
            [
                  "Thanks Larry. First, I would like to congratulate Safra for getting through all that material that was a thing to get through. Listen, thanks Larry. Good quarter for us, obviously we tracked ahead of virtually every metric that I track, whether it’s cloud bookings, cloud revenue, EPS, really everything on my KPI list was at a record level. Turning to cloud bookings, $855 million, it’s the best quarter we have ever had, it’s up 43% over what was a very strong Q4 last year. We had a goal of $2 billion in ARR. We finished with nearly $2.1 billion. Next year we will sell more. By the way booking revenue growth rates are given in CD unless otherwise said, SaaS bookings were $486 million, PaaS and infrastructure bookings $369 million. As Safra said cloud revenue growth at 66%, we are now at $6 billion annualized run rate. For total software and cloud, to Safra’s point 80%, roughly 80% of our trailing 12 months revenue is now recurring in nature. SaaS revenue while up 76% was an acceleration from 40% growth last year. ERP was up 156% organically, that did not include NetSuite."
            ]
      ],
      [
            "Hi, thank you very much. Congratulations. I am curious if you could talk about what drove the strength in license revenue this quarter is certainly much better than most people’s expectations. Did you have any products that were faced out or were comped out that you had any sort of pull-in potentially? And secondarily Safra, you talked about long-term SaaS gross margins approaching potentially 80% and if this AT&T deal is a harbinger of more databases transitioning to a PaaS model, what does the longer term outlook for gross margins for the entirety of the cloud business look like? And finally I had to sneak in one for Mark. Any thoughts on the sales force as you approach fiscal ‘18? Any changes, reorg etcetera? That’s it for me. Thank you.",
            [
                  "Thanks Larry. First, I would like to congratulate Safra for getting through all that material that was a thing to get through. Listen, thanks Larry. Good quarter for us, obviously we tracked ahead of virtually every metric that I track, whether it’s cloud bookings, cloud revenue, EPS, really everything on my KPI list was at a record level. Turning to cloud bookings, $855 million, it’s the best quarter we have ever had, it’s up 43% over what was a very strong Q4 last year. We had a goal of $2 billion in ARR. We finished with nearly $2.1 billion. Next year we will sell more. By the way booking revenue growth rates are given in CD unless otherwise said, SaaS bookings were $486 million, PaaS and infrastructure bookings $369 million. As Safra said cloud revenue growth at 66%, we are now at $6 billion annualized run rate. For total software and cloud, to Safra’s point 80%, roughly 80% of our trailing 12 months revenue is now recurring in nature. SaaS revenue while up 76% was an acceleration from 40% growth last year. ERP was up 156% organically, that did not include NetSuite."
            ]
      ],
      [],
      [
            "Thank you. Congratulations on the strong quarter. So given software support is continuing to grow would suggest that the cloud has predominantly met new workloads from either new or existing customers, we would expect at some point soon your customers are going to start moving existing workloads to the cloud, so a couple of parts to the question, when do you expect Oracle apps and Oracle database for revenue to start moving to the cloud, which moves first, what do you expect the impact will be and lastly which of the – what of the migration is baked into your confidence in FY ‘18 cloud ARR?",
            [
                  "Thanks, Ken. Good afternoon, everyone. As you can see, we had a tremendous quarter in just about every way as cloud revenue, new software license and earnings were all much better than expected. The adoption by our customers of our products and services is at an all-time high. But before going into more detail about Q4, you can also see that we have made significant improvement in our financial reporting to align with how we are running the business now. The cloud has become our predominant growth vehicle. As you can see in our press release supplemental pages, we have given you tons of detail. We have given you the detail in our new presentation format and we have also provided the reporting in our old format going back through fiscal 2016 and 2017. So, you can see the numbers the new way, the old way all including history to help your transition this quarter."
            ]
      ],
      [
            "Thank you. Congratulations on the strong quarter. So given software support is continuing to grow would suggest that the cloud has predominantly met new workloads from either new or existing customers, we would expect at some point soon your customers are going to start moving existing workloads to the cloud, so a couple of parts to the question, when do you expect Oracle apps and Oracle database for revenue to start moving to the cloud, which moves first, what do you expect the impact will be and lastly which of the – what of the migration is baked into your confidence in FY ‘18 cloud ARR?",
            [
                  "Thanks, Ken. Good afternoon, everyone. As you can see, we had a tremendous quarter in just about every way as cloud revenue, new software license and earnings were all much better than expected. The adoption by our customers of our products and services is at an all-time high. But before going into more detail about Q4, you can also see that we have made significant improvement in our financial reporting to align with how we are running the business now. The cloud has become our predominant growth vehicle. As you can see in our press release supplemental pages, we have given you tons of detail. We have given you the detail in our new presentation format and we have also provided the reporting in our old format going back through fiscal 2016 and 2017. So, you can see the numbers the new way, the old way all including history to help your transition this quarter."
            ]
      ],
      [
            "Thank you. Good morning. Preston, maybe, the first one just on the guidance here for the first quarter. I'm looking at build rate in the industry level at least projected build plans for North America calling for a modest -- a small sequential step up from 4Q to 1Q and I'm curious how PACCAR fits into that in terms of within the context of that I think you said down 5% to 7% deliveries where North America fits in relative to Europe and some of the other markets?",
            [
                  "I would like to recognize PACCAR's high performing Kenworth, Peterbilt, and DAF dealers who are the best in the industry and important contributors to our success. Truck and parts gross margins were 14.4% in the fourth quarter. Truck pricing increased during the quarter, more than offsetting costs. In the first quarter, we expect deliveries to be 5% to 7% lower than the fourth quarter due to normalized markets and build rates in North America. First quarter truck and parts gross margins are estimated to be around 14%. PACCAR continues to take a rigorous approach to controlling costs throughout the business cycle and delivers industry-leading operating margins."
            ]
      ],
      [],
      [],
      [],
      [
            "Maybe just a quick one around the North America margin outlook. Just wanted to sort of test your conviction. And if we see in fiscal '20 another year of low single-digit, but positive sales growth in Industrial North America, how confident you are that margins can expand from that, what, 16.8% level, I guess, at the midpoint for this year?",
            [
                  "Moving to Slide 10. I'll discuss the business segments starting with Diversified Industrial North America. For the third quarter North America organic sales were relatively flat as compared to the same quarter last year. With flat sales operating margin for the third quarter on an adjusted basis was 16.5% of sales versus 16.4% in the prior year. A onetime labor settlement in Mexico and a less favorable mix put pressure on margins in the quarter. Despite these headwinds North America continued to deliver improved margins which reflects the hard work dedicated to productivity improvements as well as synergies from acquisitions and the impact of our Win Strategy initiatives."
            ]
      ],
      [],
      [],
      [
            "Hi, good morning. I guess two questions, one, in the quarter, and guess as you look at your -- the remainder of the year, are there any different assumptions around price costs or your ability to get price in a market? Can you just talk about how that's going? And then my second question, sorry, back to North America Industrial; Tom, I appreciate the comments you had made about CLARCOR in closing or plants and stuff like that, and that will impact margins or incrementals over the next two quarters. But as we shift to fiscal year 2019, with most of that done, can we start to think about North America achieving more normalized incremental margins, or given where we'd be in the cycle, could you get above average incremental margins, versus your longer term target? Thanks.",
            [
                  "Moving to slide number 8, I will discuss the business segments, starting with Diversified Industrial North America. For the second quarter, North American organic sales increased by 12.7% compared to last year. Acquisitions contributed 26.3% to sales, while currency also positively impacted the quarter. Operating margin for the second quarter on an adjusted basis was 15.1% of sales versus 16.6% in the prior year. Current year includes 160 basis points of CLARCOR related incremental depreciation and amortization expense. Without this, margins improved 110 basis points."
            ]
      ],
      [],
      [],
      [
            "I am sorry. Just a clarification and I apologize for asking, in the 7.30 for the year, so it looks like we had $0.38 in the quarter or $0.35 of what you would call sort of non-recurring earnings fees as a base for 2018, does it fare – the $0.21 and you have a foreign currency gain, is there anymore foreign currency gain expected, but I just want to say we use it as a base for fiscal ‘18, should we use in closer to $7, like two things out before looking at it and the same thing in tax rate, 27.5 would we go to a normalized tax rate before any politics of the 28.5% that we sort of expected for the year?",
            [
                  "On Slide #14, you will find a reconciliation of the major components of fiscal year ‘17 adjusted earnings per share guidance of $7.30 per share at the midpoint from prior fiscal year ‘17 earnings per share of $6.75 per share. Increases include $0.09 from stronger Q2 segment operating income, $0.35 from lower other expense and $0.12 from lower SG&A expense and a lower effective tax rate. The decrease includes a $0.01 per share reduction from slightly higher interest expense. Please remember that the forecast excludes any acquisitions or divestitures that might close during fiscal year ‘17. This concludes my prepared comments."
            ]
      ],
      [],
      [],
      [],
      [],
      [
            "This is Damien on for Ramsey, so thanks for taking the questions. I just -- I'm hoping you guys can talk a little bit about your long-term growth expectations for the PEO and insurance revenue. Obviously, you've provided that preliminary framework for 2020 which I really appreciate at the low double-digits but I think -- we're thinking about that more like a mid-teens type of a rate. Can you may be dissect what's going on in there and why the deceleration year-over-year?",
            [
                  "Now, let me talk about 2020 and I would just caveat everything I'm saying by saying that we haven't completed our planning process but we thought given the Oasis acquisition and the fact that you'll need to update models. We thought we'd give you some preview of what we're looking at for the year, including Oasis. We'll provide the detailed guidance during our fiscal 2019 fourth quarter call as we always do, but let me give you some high level commentary based on a preliminary look into next fiscal year. Management solutions revenue growth, we anticipate it to be comparable to the growth in 2019. PEO and insurance revenue excluding Oasis is anticipated to reflect low double-digit growth; so that means about in the range of around 10%. Including Oasis, PEO and insurance services revenue growth will be in the range of 30% to 35% with growth higher in the first half of the year until the anniversary of the Oasis acquisition."
            ]
      ],
      [
            "Good morning, thanks for taking my question. I was wondering if you can maybe go a little further on the selling season commentary you had a minute ago. Marty, just given what you've seen from Oasis thus far, what's been the reaction from clients with respect to the addition of that to your product portfolio? And I guess, more broadly speaking, heading into fiscal '20, do you feel kind of incrementally better or worse about the growth and that kind of the core payroll franchise revenue growth heading into next year?",
            [
                  "Now, let me talk about 2020 and I would just caveat everything I'm saying by saying that we haven't completed our planning process but we thought given the Oasis acquisition and the fact that you'll need to update models. We thought we'd give you some preview of what we're looking at for the year, including Oasis. We'll provide the detailed guidance during our fiscal 2019 fourth quarter call as we always do, but let me give you some high level commentary based on a preliminary look into next fiscal year. Management solutions revenue growth, we anticipate it to be comparable to the growth in 2019. PEO and insurance revenue excluding Oasis is anticipated to reflect low double-digit growth; so that means about in the range of around 10%. Including Oasis, PEO and insurance services revenue growth will be in the range of 30% to 35% with growth higher in the first half of the year until the anniversary of the Oasis acquisition."
            ]
      ],
      [],
      [],
      [
            "Okay. And then just in particular on ASO and PEO strength, it looks like that those trends continue, in particular, just curious if there are any callouts? And then Efrain, when we get towards the end of the year, I know it gets a little more challenging on comps. So does that mean that 11% to 13% is a more normalized range for the PEO business and insurance business as we go forward past this fiscal year?",
            [
                  "Fiscal 2019 guidance. Now, I will turn to guidance for the upcoming fiscal year ending May 31, 2019. I will remind you that our outlook is based upon our current view of economic conditions continuing with no significant changes. Our guidance for fiscal 2019 is unchanged from what was provided in June, which was given reflecting adoption of ASC 606. Under our previous revenue categories, there is no change to payroll revenue guidance in the range of 2% to 3% and HRS revenue guidance in the range of 10% to 11%. Payroll services revenue was below the low end of the range in the first quarter as anticipated due to the composition of payroll processing days. Growth in payroll revenue will be at or above the high end of the range for Q2 and Q3 and Q4 is anticipated to be within the range. HRS revenue growth for the first quarter was significantly higher than the range due to the timing of the HROI acquisition. Growth for Q2 and Q3 is anticipated to be within the range. For Q4, growth is anticipated to be below the low end of the range due to a more challenging compare caused by the strong growth in the PEO in the latter part of fiscal 2018."
            ]
      ],
      [],
      [],
      [],
      [],
      [],
      [
            "Good, good. I just wanted to start by asking about what you saw from a new sales and client retention perspective in Q1? Obviously, last year, you had the tough comp on new sales and you did see some of the headwinds on retention near the back-half of the fiscal year when you made some adjustments to the client service model. So through the first quarter of 2018, at least, directionally, can you tell us what you saw from those metrics, as well as how you see them evolving during the balance of fiscal 2018?",
            [
                  "We’re updating our guidance to reflect the recent acquisition of HROI, as well as the discrete tax benefit recognized in the first quarter. We would recommend that our – we remind you, sorry, that our outlook is based on the current view of economic and interest rate conditions continuing with no significant changes, the guidance for the full-year of fiscal 2018 that we just updated is as follows: HRS revenue growth is anticipated now to increase in the range of 12% to 14% for the full-year, raised to incorporate anticipated PEO revenues from HROI. To add color on gating, we were below the low-end of the range for HRS growth in the first quarter at 7% and we anticipate that HRS growth will be in the range of 13% to 16% for the second quarter and should help adjust your models. Total revenue, as you see in our announcement, is expected now to grow 6% this total company revenue."
            ]
      ],
      [
            "Good, good. I just wanted to start by asking about what you saw from a new sales and client retention perspective in Q1? Obviously, last year, you had the tough comp on new sales and you did see some of the headwinds on retention near the back-half of the fiscal year when you made some adjustments to the client service model. So through the first quarter of 2018, at least, directionally, can you tell us what you saw from those metrics, as well as how you see them evolving during the balance of fiscal 2018?",
            [
                  "We’re updating our guidance to reflect the recent acquisition of HROI, as well as the discrete tax benefit recognized in the first quarter. We would recommend that our – we remind you, sorry, that our outlook is based on the current view of economic and interest rate conditions continuing with no significant changes, the guidance for the full-year of fiscal 2018 that we just updated is as follows: HRS revenue growth is anticipated now to increase in the range of 12% to 14% for the full-year, raised to incorporate anticipated PEO revenues from HROI. To add color on gating, we were below the low-end of the range for HRS growth in the first quarter at 7% and we anticipate that HRS growth will be in the range of 13% to 16% for the second quarter and should help adjust your models. Total revenue, as you see in our announcement, is expected now to grow 6% this total company revenue."
            ]
      ],
      [
            "Okay. And then last question for me. Efrain, you talked about the seasonality for fiscal year 2018 as I understand in HRS and payroll services, I think it's kind of in the range and then it goes to the high-end during the back half. Is that seasonality as well? And I know last year we talked about some difference in processing days. So is that not a factor this year? Thanks so much.",
            [
                  "Now what many of you are waiting to hear, further detail on the annual guidance. So I will provide this detail on the gating for fiscal 2018. First, growth in payroll services revenue is anticipated to be within the full-year range for the first half of the year and toward the high end of the range for the second half of the year. So I am going to repeat that again, growth in payroll service revenue anticipated be within the full-year range for the first half of the year and toward the high-end of the range in the second half of the year."
            ]
      ],
      [
            "Hey, thanks for taking my question. Congrats on a great finish to the year. Two questions. First, share that your customer retention improved again this year and I mean 93% is almost enterprise type level. Can you talk a little bit to the drivers to that, because your customer base is more kind of mid-market, but 93% is kind of really best-in-class and how do you get there and kind of can that go even higher potentially? And then you kind of need to explain that Wednesday kind of think again with the Wednesday receipts because a small working industry it kind of seems a bit unusual, but maybe you can give us a little bit more background there? Thank you.",
            [
                  "I am pleased to share that our annual revenue retention rate for 2019 increased, once again, to 93%, up from 92% in 2018, representing the second consecutive year of improvement after remaining steady at 91% for the prior 6 years. In addition to the DDX, in 2019, we rolled out over 1,500 software enhancements, including several important product launches, such as Ask Here, a communication platform that gives employees a direct line of communication to ask work-related questions that are routed to the appropriate company contact through the convenience of Paycom self-service technology. We also introduced substantial enhancements to our learning management platform with performance evidence and video content creator. We are kicking off 2020 with what I believe will be one of the most significant product developments of the last two years. On Monday, we announced the official launch of Manager on-the-Go, a tool built into Paycom’s existing mobile app, which empowers leaders with 24/7 accessibility to essential manager side functionality of our solution. I believe this is the single most important product release we’ve had since the launch of our employee self-service app. This easy to use functionality distributes the approval responsibilities more broadly and removes impediments to quick data flow."
            ]
      ],
      [],
      [],
      [
            "I wanted to ask about Venmo. The 40 million Venmo users, that’s an impressive number. I think that’s ahead of the most people’s estimates. But, even the Q1 exit revenue run rate now, $300 million is above our expectations. So, just trying to get a feel where the excess growth is coming from or just give us a sense of the magnitude of the growth. Is it pay with Venmo, debit, instant transfer? And then, secondly, hearing plans to come out with a Venmo credit, maybe you could talk about that as well. Thanks.",
            [
                  "In January, we reported that Venmo had an annualized revenue run rate going into 2019 that exceeded $200 million. I'm very pleased to report that our annual revenue run rate coming out of Q1 is now over $300 million. And with over 40 million active users growing substantially each and every quarter, we fully expect to see that annualized revenue number continue to grow."
            ]
      ],
      [],
      [],
      [],
      [
            "Hey, guys. Good afternoon. First question I had is just to clarify a comment Jack you made about the loan balances. So, if we take the year-end loan balances of call it $43.6 billion and that grows sort of 2% to 4% -- and did I hear correctly that you’re going to see runoff of $300 million to $400 million on the United portfolio this year and another $300 million to $400 million from New York multifamily runoff?",
            [
                  "With that background in mind, let me outline our goals for the full-year 2020, as listed on slide three. It is important to note the following goals incorporate a full year of Belmont and United. The first goal is to grow our core loan portfolio in the range of 2% to 4% on a period-end basis. The core loan portfolio excludes the runoff of select United loan portfolios, which ended 2019 with an aggregate balance of $1.346 billion. This balance is less than the approximately $1.8 billion in runoff we referenced at the acquisition’s announcement, due to a subsequent decision to sell $492 million of these loans. As such, these balances are included in the loans held for sale line on the balance sheet. We expect the runoff of the select United portfolios to be in the range of $300 million to $400 million for the full year. Core loans also excludes the transactional portion of our New York multifamily portfolio, which is in runoff mode. Period-end balances for this portfolio finished 2019 at $737 million. We expect the runoff in the transactional New York multifamily portfolio to be in the range of $300 million to $400 million for the full year. After excluding these portfolios, the balance at year-end 2019 for core loans was $41.513 billion."
            ]
      ],
      [],
      [],
      [
            "So just following up on some of the questions. I was hoping you could review a bit your visibility around the 4% corporate organic sales growth top line target for 2020. You’re obviously coming off a solid year, so we’ll have a tough comparison. There’s some global volatility. So just wanted to get your perspective on the level of visibility at the corporate level. And obviously, we just covered Frito-Lay North America and PBNA, but perhaps you could also review what drove the strong momentum in D&E markets in 2019 and sustainability as we look out to 2020? Thanks.",
            [
                  "And Frito-Lay was once again the number one contributor to U.S. food and beverage retail sales growth in 2019. With respect to the fourth quarter, Frito delivered 3% organic revenue growth, driven by 2% volume growth and 1% net price realization. The deceleration in net price realization. The deceleration in net price realization was largely a function of the timing of pricing actions taken in 2018. We expect our net price realization trends to improve over the coming months and have strong innovation and merchandising plans in place for the business to deliver very good growth in 2020."
            ]
      ],
      [],
      [],
      [],
      [],
      [
            "So I have actually three questions and all under the umbrella of your philosophy, Ramon. One is that you mentioned you met with clients and consumers and employees. But it doesn't seem like you'd done a lot of meetings with shareholders in forming your observations and priorities. And just wanted to understand why. Clearly, the lot of folks on this call are your owners. Secondly, your philosophy on reinvestments, how does that apply to your philosophy on price/mix rationality, for a lack of a better term, i.e. kind of measured increases and pricing over the past few years, and beverages has taken that industry out of the penalty box for investors, so I'd love to hear your philosophy there. And lastly, your level of confidence that one year of reinvestments is enough to get back to your accelerated long-term growth algorithm 2020 and beyond.",
            [
                  "So with these observations in mind, let me move on to our priorities. Our first set of priorities relates to becoming faster, specifically, accelerating our rate of organic revenue growth. And if there's one thing I'd like you to take from our discussion today is that, we view topline acceleration as the single biggest opportunity to create more shareholder value. To achieve accelerated topline growth, we intend to strengthen and broaden our product portfolio packaging formats to win locally in convenient foods and beverages. And this means growing our core businesses as we continue to evolve our product portfolio and sharpening our focus on key geographies."
            ]
      ],
      [
            "So I guess I wanted to actually ask about Frito-Lay North America, Ramon. So clearly, that business has been on a pretty solid footing. You talked about the potential opportunities to grow that business further. A lot of the growth in the last few years has come from price/mix. So I'm just wondering if you can elaborate on more specific programs to really drive consumption and volume increases in Frito-Lay. And then separately, Ramon, I think you talked about being happy with the portfolio, and not really making a big changes to your portfolio, either acquisition or divestiture. I know you guys been looking at North America beverage business from a refranchising perspective. Is that now off the table as you kind of went through the review in the last 4 months?",
            [
                  "With that said, in a dynamic market, NAB has faced a number of challenges over the past 18 months. New entrants have come to market in some of our stronghold categories. There are opportunities to improve some of our brand marketing and consumer engagement. And there are areas where we can step up our local marketplace execution. We have good plans in place to address these opportunities. We've increased both the quality and level of A&M on key core brands, including Pepsi and Mountain Dew. We've increased our innovation to address new category entrants and to drive success in higher growth segments, with innovations like LIFEWTR, bubly, Gatorade Zero, new variants of Propel and extensions within our successful Starbucks and pure life -- Pure Leaf Tea guidance."
            ]
      ],
      [
            "My question is around -- I'm just hoping you can actually elaborate on what you can do in the route to market field, just a little more detail, because if I think about the beverage business, it feels like you have some catch-up, particularly in North America. In snacks, you're already really, really good. So taking the 2 different sides, are you going to focus more on the small channels where brands are often built and nurtured? And how do you manage an online business when you're shipping heavy beverages? So just touching on that range of opportunity.",
            [
                  "Within snacks, we intend to further capitalize on the consumer trends of convenience and on-the-go in locally relevant ways. Here, we see themes of convenient mini meals, local street foods and local recipes, just a few inspirations to evolve our portfolio in very locally relevant ways. We intend to rapidly scale our beyond the bottle initiative, building on the foundations of our recent acquisition of SodaStream and our internally developed Spire, Drinkfinity and Aquafina water station platforms to offer consumers even greater variety and choice in beverage formats. From a geographic perspective, our priorities are clear: #1, invest to sustain Frito-Lay North America's growth and leadership; #2, strengthen North America Beverages to grow sustainably with the market; and third, accelerate our international expansion with a disciplined focus on right to win markets."
            ]
      ],
      [],
      [
            "So I wanted to come back to portfolio considerations with beverages and snacks. So particularly, Ramon, the ability to drive more consumption occasions, so under sort of the thinking of the two or Better Together. And it sounds like you too are of the view that the beverage and snacks do belong together. But I think there have been some questions on how successful the company has been in that pursuit of cross-selling over the years, particularly given some of the notable challenges in beverages. So do you see it that way? Is that an unfair assessment that the company has not done as well as it could possibly could in terms of cross-selling and utilizing the strength of both of these businesses. And as you're thinking about the priorities of how to reaccelerate growth in NAB, is there a greater cohesiveness with Frito that could be part of that strategy? So any comments there will be helpful.",
            [
                  "And from this review and assessment, we emerged with a set of what I'll call observation and a very clear set of go-forward priorities. Let me begin with the observations. Fundamentally, we're a highly-focused convenient food and beverage company. We compete in very attractive, large, growing and highly complementary categories that share many common characteristics, including consumers, customers, shoppers and occasions. Our ability to leverage the scale of our business to invest in and deploy new capabilities and technologies is a competitive advantage. Furthermore, we have tremendous potential to expand consumption across multiple dimensions. We believe we can capture a greater share of consumption occasions by considering to broaden our portfolio to provide greater choice to satisfy consumers evolving taste, whether they are seeking for an indulgent treat or a more nutritious snack, hydration or a functional drink, on-the-go convenience or take-home value. And we also see the opportunity to continue to increase consumers perceived visibility of our products as an additional growth avenue."
            ]
      ],
      [
            "Hey, good morning. So, Indra, clearly, there has been a lot of investor focus around the number of pressure points in the CPG industry in terms of pricing power brand demand fragmentation etcetera, etcetera and basically that some of the traditional advantages of larger CPG companies are breaking down. In that context, I was hoping you could give us some perspective on if there are areas of significant investment or operational changes at Pepsi going forward beyond what you have already done to help position the company versus some of those industry challenge is and how realistic a long-term high single-digit earnings growth algorithm beyond 2018 is if you need to reinvest it again some of those pressure points? And within that answer I was hoping specifically you could touch on price mix, you have obviously had strong pricing realization in the last few years with the inflationary commodities in the trade and tariff risk, I’d love some updated thoughts on price mix also within that? Thanks.",
            [
                  "Thank you, Indra and good morning everyone. I will just provide a quick update on the outlook and then we will move to your questions. From a macro perspective, we maintain a fairly positive view overall. However within this broadly positive picture, there remains risk of volatility both in geographic markets as we saw in Brazil in the most recent quarter and in currencies as witnessed by the recent sharp rise in the strength of the U.S. dollar. From an industry standpoint, we continue to see pretty challenging conditions, including a dynamic retail and consumer landscape, a very competitive environment and ongoing commodity inflation. So putting this all together in considering our year-to-date performance, our guidance for 2018 remains unchanged. Specifically, we expect organic revenue growth at least in line with our 2017 growth rate or 2.3%."
            ]
      ],
      [
            "Thank you. Good morning, Indra. Good morning, everyone. Two quick questions. One, I understand that you are reinvesting in the tax benefits, but can you clarify whether that’s more heavily geared to reinvesting in beverages or is it pretty much evenly across the business? And the second question which is related to that when you see a success that Coca-Cola has had with the Diet Coke new products and with Coca-Cola Zero Sugar, any thoughts in terms of how things would be done different on the Pepsi side of things? And the reason I asked that is that if the brands themselves having been improved in terms of innovation, how much is reinvestment and more marketing going to help? Thanks.",
            [
                  "We encourage you to read the full report, but I’d like to take just a few minutes this morning to provide you with the highlights. We are in millions of pantries and refrigerators worldwide. So we know we have a tremendous opportunity and responsibility to use our scale to make a positive impact on the world. Our customers, employees and partners feel good knowing that there is a shared journey of sustainable transformation making our products more nutritious and more resource efficient, dialing up the taste while reducing our environmental footprint. Our investors can feel good knowing this makes us a stronger business over the long-term, that we can also do well by also doing good. 12 years ago, we embarked on a journey of PepsiCo, as we call, Performance with Purpose. Since then, much has changed at PepsiCo and around the world, but the underlying principles behind Performance with Purpose remain. Much of our early work on Performance with Purpose requires us to think differently about our business and make the kinds of long-term investments from researching and developing new more nutritious products to finding ways to reduce water and energy use across plants and farms that will help us deliver on the vision of making our growth, our operations and our impact more sustainable. Sustainability has been defined as meeting the needs of the present without compromising the ability of future generations to meet their own needs. Over the last dozen years, we have tried to meet the needs of the present, while strengthening the ability of future generations to meet this integrating that aspiration into our goals for products, planet and people."
            ]
      ],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [],
      [
            "Just a couple of different questions. But could you talk a little bit about the marketing for Disney+? With the launch less than three months to get -- away, you've talked at the Analyst Day about having 90%-plus awareness. Can you just -- I haven't seen marketing yet, so can you talk about the plan? Different topic but on all of the stuff that's going on in China as well as in Hong Kong, can you talk a little bit about -- or give us some color on what you're seeing in terms of impact on -- towards some of the parks and how it might be affecting pricing and future investment? And then one last kind of follow-up on the pricing. You did increase prices unusually, I think just -- I'm not sure if it's just Disneyland. Can you talk about how you're thinking about pricing going forward at the domestic parks?",
            [
                  "Before I conclude, I'd like to highlight a few additional items, such should help frame our fiscal 2020 first quarter and full-year results. First, we expect our Direct to Consumer & International segment to generate about $800 million in operating losses for the quarter. We expect the continued investment in our DTC services, specifically Disney+, which will launch in just a few days and the consolidation of Hulu to drive an adverse impact on the year-over-year change in segment operating income of our direct-to-consumer businesses of approximately $850 million."
            ]
      ]
]