[
      [
            "So, you reiterated guidance this morning for 2020, just want to clarify if the guidance already includes any impact from HIT repeal on midyear renewals and also the benefit from the Diplomat acquisition? And then another follow-up on the dual growth, I mean, obviously 15% to 20% is what is the implied growth which is strong and above market, but when we think about that, can you just kind of like help us think through the Part D dynamics and how that would slow through the P&L if it’s going to to have any impact on OptumRx throughout the year?",
            [
                  "We enter 2020 with diversified growth momentum, balance sheet strength and financial flexibility. On earnings progression, we continue to expect 47% to 48% of full year earnings per share to be realized in the first half of the year, a point to keep in mind on that quarterly progression. 2019’s first quarter has one fewer work day than 2018’s resulting in a higher earnings level. This year, the first quarter had a more normal mix, but then adds an extra day due to leap year. Taken together, the day count shifting has a year-over-year impact on the medical care ratio of about 80 basis points. This will result in the first quarter 2020 MCR running higher than the second quarter and earnings per share progressing accordingly, with just under 55% of the first half earnings expected to be realized in the second quarter. These impacts of course were fully contemplated in that 2020 outlook we have provided at the beginning of December. For full year 2020, we continue to expect revenues to approach $262 billion and adjusted net earnings per share in a range of $16.25 to $16.55. Consistent with our prior practices, we will more formally address these and other expectations after the first quarter."
            ]
      ],
      [
            "When I look at drug costs being well under control, down maybe under 1%, hospital base flat, just millions of point solutions popping out for every healthcare spend category you can think of. I struggle to connect all those dots to help trend -- cost trends still being 6%, which is as you know 3x CPI. So, in your mind -- and then, you guys doing dozen things in local markets to push risk downstream and that sort of thing. So, what will it take to get the step function trend down say a couple of hundred basis points beyond all the good work that you've already done? I am just struggling why so persistently high. And the Kaiser survey and the political landscape is pointing to this being kind of a bigger and bigger problem, especially with the rise and high co-pay plans. So, is there a horizon where cost shutdown down or are we just stuck at 5%-6% forever more, no matter what we do?",
            [
                  "Our relentless focus on quality, experiences and costs is increasingly apparent. Our NPS levels have never been higher; we just completed our regular three-year Medicare audit with exceptional results; expected members in 4 Stars or greater plans for 2021 payment year are at an all-time high of 84% at UHC and a consistently strong 92% at Optum. Our overall per capita health care cost trends have averaged well below 4% for the past half decade, even as we’ve expanded MA benefits, and our operating costs continue to come in line, preserving consumer premiums for medical care. You should get a sense today that our business is progressing across multiple dimensions with many of our growth and performance efforts beginning to fall in place."
            ]
      ],
      [
            "I wanted to talk a little bit about the comments that you were making about this movement towards value-based care and that 50% of the population will be in there in a few years; and then kind of juxtapose that with all of the work you guys are doing on sort of retail attachment points, right, and specifically around MedExpress and some of the physician groups that you're working with. How does that work together? How do we get more coordinated, more value-based care in the OptumCare physicians; and then also have this huge growth in what look like retail settings and what tends to be a little bit more episodic or fragmented care with less connection to the primary care docket at a nursing care center, for example?",
            [
                  "More broadly, UnitedHealthcare continues to deliver distinctive performance for customers and to drive consistent growth and share gains over time. We provide information to doctors about their performance across their UnitedHealthcare patient panels. Doctors want this data, and we want and need more doctors to qualify as being among our best care providers. We find the better doctors, whom we refer to as premium designated physicians, deliver consistently higher quality and average nearly 20% lower costs for a full episode of care when compared to non-premium physicians. We want to help as many of our patients as possible to be treated by these doctors. Our digital services, call advocates, consumer-centric benefit designs, nurse coaches, everything is designed to get people to the best care providers and at the best sites for care affordably. We also serve people by helping them close gaps in care, which often can be caused by deviations from evidence-based medical practice, failure to modify lifestyle behaviors or the impact of social determinants of health. This is a broad-based, collaborative approach with outreach to physicians and to people's homes through Optum's HouseCalls, through our many retail partners and through our call and digital engagement channels. We've tracked and closed tens of millions of gaps in care in the last year alone from simple things like a flu or a pneumonia vaccination to the much more complex, identifying urgent needs that save lives. They all help people live healthier lives and demonstrate to them that UnitedHealthcare compassionately cares about them."
            ]
      ],
      [
            "Wanted to just touch on the $400 million to $500 of minimum MLR rebates. I’m sort of curious to understand whether that had anything to do with sort of pricing plans for the all tax regime and what that could mean for 2019. And relatedly on the incremental investments side of things these were described as accelerated programs in the release. And I’m wondering if you can sort of give us a flavor for how much flexibility that might enable for 2018 and then looking into 2019 as well?",
            [
                  "More specifically corporate tax reform is expected to improve earnings and cash flows by $1.7 billion in 2018. That’s after an estimated $400 million to $500 million reduction in premium revenues due to minimum loss ratio and lower net health insurance fee recapture effects and a 200 million to 300 million additional investment and operating costs as we accelerate existing initiatives and artificial intelligence, data analytics, individual health record custodianship, digital health, net promoter score improvements and health related initiatives in local communities."
            ]
      ]
]